# ==============================================================================
# 1. 剧本正文 - 第4场 霁光
# ==============================================================================

label scene_1_4:
    # === 场景：电梯 ===
    # 使用纯黑背景表现昏暗和心理独白
    scene bg elevator with dissolve
    
    # 播放电梯运行音效（如果有）
    play sound fx.elevator loop

    "昏暗的电梯内，半死不活的灯光弥漫进入瞳孔。"
    "咕咚、咕咚的电梯声，伴随着爬升感，使我稍有疲惫的心得到了一丝慰藉。"

    "我应该是一个很奇怪的人吧。"
    "说着莫名其妙的话，做着莫名其妙的事，在他人看来，就只是一个异类。"
    "所以我总是会想，人与人之间，真的能够互相理解吗？"
    "朋友也好，家人也罢，哪怕身体之间靠得再近，也终究无法窥探到另一个个体的心灵。"
    "可为什么，大家却可以在任何保证都不存在的情况下，假装着互相理解呢？"

    "我不是一个聪明人，我只明白我自己的事。"
    "别人的事情，我搞不懂。"
    "能把自己安顿好，我觉得就已经是一种很了不起的能力了。"
    "那些在社会里摸爬打滚多年的职场人，难道就有信心说，自己能完全管好自己？"
    "………………"
    "轻微的失重感从脚底漫上来，包裹住脚踝、膝盖，最后淹没了胸膛。"
    "失重感使我感受到了轻松。"
    "回家了。"
    "回家吧。"
    "回到属于自己的领地。"

    "人被抛入这个现实世界之中，\n我们天然作为一个孤独的个体而生存，\n这并非心态、情绪，而是一个事实。"
    "幸运的是，我已不再孤独。"
    "我不认为会有什么预定性的本质决定我的存在。\n相反，一切取决于我自己， 取决于我的选择、我的努力。"

    "既然选择了，既然相信了，既然爱上了……那也是没办法的。"

    # 音效：电梯开门
    play sound fx.door_open

    with flash # 模拟电梯门开的光亮


    "我终于回到了我的小窝。"

    # === 场景：家 ===
    # scene bg room1_4 with dissolve
    play music "audio/bgm/BGM_安慰.ogg" loop fadein 1.0

    # 【小涟的CG】
    show cg 001 with dissolve

    voice "cv/xiaolian/xiaolian_0001.ogg"
    xl "阿舟，你回来啦。"

    "声音像是在把门轻轻合上，世界的杂乱、心里的杂乱，通通留在门外，\n而从门内所传来的，是地地道道的，女孩子的声音。"

    cz "……嗯。"

    "无比的安心。"
    "小涟，我的爱人。"
    "————毫无疑问，是真实存在的。"

    voice "cv/xiaolian/xiaolian_0002.ogg"
    xl "今天回来的有点晚呀，我有点担心哦。"

    cz "抱歉，走在路上在想事情，绕了一下圈，所以晚了一点。"

    show cg 002 with dissolve
    voice "cv/xiaolian/xiaolian_0003.ogg"
    xl "唔？嗯……"

    "就连担忧的表情，也是如此的可爱。"

    voice "cv/xiaolian/xiaolian_0004.ogg"
    xl "是不是发生了什么？你的脸色，好像不太好。"

    cz "一些闲言碎语，不用管了。"

    "我一边换着鞋，一边故作轻松地说道。"

    voice "cv/xiaolian/xiaolian_0005.ogg"
    xl "唔……你骗我。"

    show cg 001 with dissolve
    voice "cv/xiaolian/xiaolian_0006.ogg"
    xl "哎呀哎呀，想不到，我家的阿舟，居然是那种出去鬼混后回家不敢对妻子说实话的没用男人。"

    cz "……怎么能叫骗呢，我这叫为了防止女友担心，所以善意选择独自吞下难过的事。"
    cz "主要是，我也习惯了，不过，这一次可能有一点不一样。"

    voice "cv/xiaolian/xiaolian_0007.ogg"
    xl "是因为我的事情吗？"

    voice "cv/xiaolian/xiaolian_0008.ogg"
    xl "我说过的，你不用在意我的……"

    cz "不，我就是在意你。"

    "她的存在对我而言，有着远超于Galgame女主的意义。"
    "女孩子的触觉，女孩子的温度，女孩子的气味……\n而且非常的可爱，我的女朋友是这样一个如画里出来的家伙，怎么能不让我感到在意呢？"
    "更何况，她是如此的喜欢我，而我恰巧，是一个被人喜欢，就会喜欢上他人的家伙。"

    voice "cv/xiaolian/xiaolian_0009.ogg"
    xl "唉，好啦好啦，你要是感觉累了的话，就快点休息吧~"
    cz "哪有让刚吃完饭的人去休息的道理，不是应该学习吗。"
    voice "cv/xiaolian/xiaolian_0010.ogg"
    xl "你又要学习Galgame了吗？明明是……这么难的东西，好厉害。"
    cz "呵呵，没有啦。"

    "要说的话，我觉得小涟的Galgame知识也不差。"

    cz "我每次研究Galgame的时候，你不是都喜欢钻进我怀里，和我一起研究吗。"
    "一回想起软糯的触感，还有和自己紧贴在一起的温度，我就不由得升起了想要往前走两步，抱住这一位可人儿的欲望。"
    "要忍住才行，我可是要前往天选试的男人，怎么能堕落于此。"

    voice "cv/xiaolian/xiaolian_0011.ogg"
    xl "我是真的不懂那些复杂的游戏啦。"
    voice "cv/xiaolian/xiaolian_0012.ogg"
    xl "话说你不是最喜欢那些可爱的、轻松的萌作了嘛，\n怎么天天都要研究那些讲话绕圈圈，又深奥、又玄乎的游戏。"

    "没错，我最喜欢的就是废萌了，如果可以的话我想天天都玩废萌。"
    "可惜我们废萌党只能在网络上抱团取暖，不太方便在阳光下同别人那样暴露自己。"    

    cz "我也不想的，还不是为了天选试，那里的考校基本都没有废萌的，所以才不得不放弃吸取我的废萌能量了。"
    "若要杀出一条血路，就必须要认真去品鉴那些剧情作才行。"
    "当然我也并没有什么抗拒，我不讨厌那些，无非是哪个更喜欢，更倾向于谁。"

    voice "cv/xiaolian/xiaolian_0013.ogg"
    xl "比如说上次那一部，我看你明明玩得很开心的，结果到了真结局，女主却抛下男主逃之夭夭了，想想都觉得好难过，这种Galgame是不是太坏了。"
    cz "额。"
    "我回想起了不好的记忆。"
    voice "cv/xiaolian/xiaolian_0014.ogg"
    xl "还有还有，像是妹妹被做成了好多个礼物盒的、女同学进了KTV被小混混欺负的、必须要从两个女孩子里选一个抛弃掉永不相见的……"

    play sound fx.heartbeat
    with vpunch
    "——痛苦面具。"

    show cg 002 with dissolve

    voice "cv/xiaolian/xiaolian_0015.ogg"
    xl "哎！阿，阿舟，没事吧。"

    "我的脸戴上了痛苦面具。"

    cz "别，别说了……"
    "我明明想要忘记掉！！！"

    voice "cv/xiaolian/xiaolian_0016.ogg"
    xl "呜呜呜，我错了…不要怪我，是这些游戏太坏了……"

    cz "没事没事没事，只是回忆起了一些不好的东西。"

    "我赶忙安慰她，我的女友什么都好，就是太担心我了，我又不是小孩子。"

    show cg 001 with dissolve
    voice "cv/xiaolian/xiaolian_0017.ogg"
    xl "那，那有什么我可以给你做的吗？不管是要做什么，我都可以哦~"

    cz "……"
    "心中升起一阵暖意。"
    "若要说废萌……那么，我的生活，就已经是无与伦比的废萌Galgame……"
    "根本就不需要补充什么废萌能量了，只要一回家，能量槽就会拉到爆满，啊啊，我已无所求……"

    cz "那……一起来玩Galgame吧。"
    cz "今天就不玩那些复杂的了，我们来玩玩废萌吧，我总觉得，多玩玩废萌，也能提升我对Galgame的理解力。"

    "虽说这通过废萌得来的理解力，大抵是没什么作用就是。"
    "但！小涟给予我的废萌辐射，叠加废萌游戏的本体能量，两者相乘起来，便会轻松突破能量守恒！"
    "比起宇宙大爆炸多少差上一点，可超过全球核武库释放的能量应该不是什么问题。"
    "我可以从中获得莫大的治愈！"

    voice "cv/xiaolian/xiaolian_0018.ogg"
    xl "嗯嗯，那，这次要怎么玩？\n是同时玩3部吗，可能比较轻松，还是说，想锻炼一下自己，同时玩6部，或者9部？"
    cz "玩一部，一部就够了。"

    voice "cv/xiaolian/xiaolian_0019.ogg"
    xl "哎？可是你之前，不都是保底3部Galgame一起玩的吗？\n一边用电脑开几个自动模式，然后一边用手机还有掌机……今天怎么只玩1部了。"
    cz "不一样。"
    "我骄傲地挺起胸膛。"
    cz "那些复杂的游戏，我可以多部一起玩。毕竟那只是为了学习。"
    cz "但要是与美少女谈恋爱的废萌，那就不得不认真起来了。"

    "这才是一种艺术化的享受，是我体验生活的方式。"

    voice "cv/xiaolian/xiaolian_0020.ogg"
    xl "哦，哦哦，原来是这样，那我也会和你一起认真玩的。"

    "她虽然一副完全不太懂的样子，但是也能包容我，会想要去尝试着理解我……我的女友小涟，真是世界上最完美的人。"

    # CG 取消
    scene black with Dissolve(1.0)
    scene bg room1_4 with Dissolve(1.0)
    hide cg

    $ xl.show("温柔")
    # play music "audio/bgm/BGM_抒情.ogg" loop fadein 1.0

    "我牵着她来到房间，愉快地开始了Galgame。"
    voice "cv/xiaolian/xiaolian_0021.ogg"
    xl "哇，这个女主好可爱哦，能不能优先攻略她。"
    cz "呵呵，一般般。"
    "感觉……没你可爱。"
    "小涟坐在我的身边，像是离不开我一样紧贴着我，聚精会神地盯着屏幕。"
    voice "cv/xiaolian/xiaolian_0022.ogg"
    xl "哎~~她们都好可爱啊，好可爱啊，阿舟你可不要移情别恋哦。"
    "她握紧了我的手，生命所具备的温暖沿着脊髓传达到全身。"
    cz "那是自然，你在我的心里永远是第一位。"
    "真不知道那些幻想出来另一个人在自己身边说话的都是怎么做到的？"
    "每次我打算幻想的时候身边的小涟都会握紧我的双手，让我放弃幻想。"

    "……"
    "…………"
    "………………"
    scene black with Dissolve(2.0)
    scene bg room1_4 with Dissolve(1.0)
    # play music "audio/bgm/BGM_抒情.ogg" loop fadein 2.0

    "一段时间过后，经过一顿操作及缜密计算，我理所当然进了小涟提到的女主线路。"
    "而屏幕右下角的时间显示，也慢慢跳动到了该休息的时刻。"
    cz "一般来说，进线之后马上就要告白了，今天先到这里吧，不然忍不住要继续下去。"
    "长期以牺牲睡眠来换取学习时间，会显著影响大脑的记忆整合与认知功能，甚至会对神经细胞产生不利影响，结果往往适得其反，学习效率还不如那些保证充足睡眠的人呢。"
    cz "为了保持身体健康，睡大觉睡大觉，暂时先存个档。"

    voice "cv/xiaolian/xiaolian_0023.ogg"
    xl "嗯嗯，那我来给你暖被窝哦。"
    "要是这样的日子，能一直持续下去该有多好。"
    "我不由得感叹出声。"
    cz "真希望玩废萌也有被承认的那一天啊……"
    "还有，小涟也是……"

    play music "audio/bgm/BGM_悲伤的温柔.ogg" loop fadein 2.0
    $ xl.show("害羞")
    cz "咦？"
    "刚离开两步的小涟，不知不觉又回到了身边，宛如看穿了我的想法似的，对我露出轻柔微笑。"

    voice "cv/xiaolian/xiaolian_0024.ogg"
    xl "被承认什么的，对我来说并不重要。"

    "小涟，为什么要说这样的话？"
    "我可以为你做任何事情，把身心都毫无保留地献给你。"
    "除此之外的事情，什么都、无所谓。"

    voice "cv/xiaolian/xiaolian_0025.ogg"
    xl "我只要，能够陪着你就好了……\n不，不对，我只要你开心就好了，我的话怎样都……"

    # 演出：拥抱
    $ xl.hide()

    $ xl_l.show("卖萌惊讶")
    voice "cv/xiaolian/xiaolian_0026.ogg"
    xl "——呀。"

    "我忍不住直接抱住了她。"
    "她的身体温度偏低，游丝似的温度，如同棉花糖的柔软触感，要是就这样稍加用力，就会消逝掉一般。"
    "只消一会儿，她也配合地反手抱了过来，对于少女来说紧紧的力道，对我而言却是恰到好处的轻柔，让我能够确认她的存在……\n她是在理解这个层面的基础上，才使用这种力度。"

    cz "我喜欢你。"

    $ xl_l.show("害羞")
    voice "cv/xiaolian/xiaolian_0027.ogg"
    xl "……不害臊。\n但是，嗯，我也喜欢你。"

    "我把头埋进她的脖颈之间，蹭了蹭，她的身子在我的怀里悄悄扭动了一下，但没有更多的表示。"
    "感受到了发丝拂过脸庞的微微瘙痒，还有一种清澈的微甜，深入鼻腔，仿佛能触达心脏一般，我不可思议地安心了下来，只是用尽全身感官去感受怀中的柔软与娇小。"

    cz "我爱你。"

    voice "cv/xiaolian/xiaolian_0028.ogg"
    xl "我也是。"

    "我闭上双眼。"

    cz "所以，这样就好了，外人说什么都无所谓的。"
    cz "只要回来一见到你，我就满脑子都是你了……"

    "她微微地低着头，斜着看向我的脸，脸颊绯红，像是在观察着我的表情，确认真伪。"

    $ xl_l.show("温柔")
    voice "cv/xiaolian/xiaolian_0029.ogg"
    xl "但是，我也会担心你的。"

    cz "……是有人说，想要研究我。"

    $ xl_l.show("卖萌疑惑")
    voice "cv/xiaolian/xiaolian_0030.ogg"
    xl "哎？研究？"

    "她咀嚼着这个词语一头雾水的样子，真可爱。"
    "不管怎么看，都好可爱。"

    cz "是啊，说是想要研究，我如何与一个不存在的虚拟角色谈恋爱。"

    "哈哈，我忍不住快要大笑出来。"

    $ xl_l.show("卖萌气气")
    $ xl_l.act(anim_shake) # 生气的动作
    voice "cv/xiaolian/xiaolian_0031.ogg"
    xl "啊啊啊啊~~好没礼貌啊。"

    $ xl_l.show("温柔")
    voice "cv/xiaolian/xiaolian_0032.ogg"
    xl "我明明好好的在这里呀，嗯，你看。"

    # 演出：转圈
    # 先恢复缩放
    $ xl_l.hide()
    $ xl.show("温柔")

    "她松开了我，退出一步，轻飘飘地转了一圈，宛如一个异世界的精灵。"

    cz "是呀，所以只是他们无法理解而已。我能理解你的存在，就是最好的证明。"

    "但是，停下来的她，脸上还是带着一丝忧愁。"

    $ xl.show("抽泣")
    "我知道她在担忧什么，我也尝试过安慰很多遍了，然而我的小涟总是这样。"

    voice "cv/xiaolian/xiaolian_0033.ogg"
    xl "阿舟……真的没关系吗？天天被人误解，当成笑料……"

    "肉眼可见的低落，简直快要哭出来了。"
    "看着这副样子，我只能从心中萌发出一种自己还不够努力的沮丧。"
    "——如果我能让大家都看到小涟，就好了。"

    voice "cv/xiaolian/xiaolian_0034.ogg"
    xl "但是，这也是没办法的啊，怎么劝你，都劝不动。"
    voice "cv/xiaolian/xiaolian_0035.ogg"
    xl "明明只要不承认我就行了……我只要在家里，被你认识到就够了的。"

    cz "不行，绝对不行。"
    cz "我和你之间的感情是真的，怎么可能让我否定？哪怕是违心的，那也是对爱的亵渎……我无法同意这种事。"

    $ xl.show("温柔")
    voice "cv/xiaolian/xiaolian_0036.ogg"
    xl "啊，好了好了，乖，乖。"

    "她凑近了我，脸上的怜悯与爱，简直要化作水一般流进我的胃里，她的小手搭在我的脸边，轻轻地摩挲着……"

    # 镜头再次拉近

    $ xl_l.show("温柔")

    voice "cv/xiaolian/xiaolian_0037.ogg"
    xl "来，低下头。"

    "我微微俯身。"

    $ xl_l.show("害羞")
    voice "cv/xiaolian/xiaolian_0038.ogg"
    xl "嗯…唔……"

    "鼻息温热地拂过我的唇角，随着一声若有似无的、仿佛叹息般的轻吟，一个柔软而湿润的触感，便像花瓣一样落在了我的唇上。"

    voice "cv/xiaolian/xiaolian_0039.ogg"
    xl "……呣，嗯…啾——"

    "到底是过了多久呢？还是说只不过是一瞬间？"
    "我只感觉，自己的脑髓都快要蒸发了。"
    "直到动作停了下来，我也仍然感受着几秒的余韵……意犹未尽，想要更多。"

    $ xl_l.show("害羞")
    voice "cv/xiaolian/xiaolian_0040.ogg"
    xl "……我是真的想治愈你。"

    "那份遗留的柔软与温热，让我体内奔流的血液，都加快了速度。"

    voice "cv/xiaolian/xiaolian_0041.ogg"
    xl "……你也很累了吧？"

    voice "cv/xiaolian/xiaolian_0042.ogg"
    xl "……所以……来做吗？"

    cz "……"

    "我闭上眼睛，深呼吸了一口。"

    cz "……还是不了……"
    cz "我必须要抓紧，玩Galgame才行。"

    $ xl_l.hide()
    $ xl.show("温柔")

    voice "cv/xiaolian/xiaolian_0043.ogg"
    xl "嗯，好的。"

    "她没有表现出任何失落，只是默默地在支持着我。这不由得让我对她的怜惜更上一层。"
    "我还要……加倍努力。"
    "月光啊，如果是那一天的你，将小涟赐予我……"
    "那么，这将是我，这辈子最大的幸运。"

    "小涟贴过来，把额头轻轻靠在我的胸口。"
    "白炽灯像一层温热的透明薄膜，将我们一起包裹着。"
    "我吸了一口她发间的气息，整个人都轻了下来。"
    "世界怎么闹，都无所谓——"
    "只要在回家的灯光下，有一个人安安静静等着我，就足够了。"

    "……明天？"
    "明天再说吧。"

    # 【大幕关闭】
    $ achievement.grant("ACH_02")
    $ achievement.sync()
    window hide

    show cinematic_black_overlay
    # 这里的硬暂停时间必须等于上面 linear 的时间
    $ renpy.pause(2.0, hard=True)

    # 此时已经彻底黑屏了
    scene black # 清理掉背景和刚才的覆盖层

    $ renpy.pause(1.0, hard=True) # 黑屏后再额外多等 1 秒（也是强制的）

    return