label scene_2_3:

    # === 街道（白天） ===
    play music "audio/bgm/BGM_日常.ogg" loop fadein 1.0
    show bg street3_1 with Dissolve(2.0)

    "我一直把林曦当成我的好哥们看。"
    "从小到大，都是这样的，从来没觉得有过什么问题。"
    "但是，在牵着手的当下，甚至还是这样一种…五指相扣的情况。"
    "哪怕只是临时的模拟，也很难让我不想入非非。"
    "我从昨天起，就发现了。"
    "林曦这家伙，说不定还怪几把可爱来着？"

    $ lx.show("微笑")
    voice "cv2/linxi/linxi_0093.ogg"
    lx "~~♪"

    cz "已经……没办法做朋友了……"

    $ lx.show("惊讶")
    $ lx.act(anim_jump)
    voice "cv2/linxi/linxi_0094.ogg"
    lx "唉，唉唉唉唉？？！"

    cz "Galgame背叛了我。"
    cz "我……从没觉得玩Galgame开心过……"

    "我从Galgame里可没学到这些知识。"

    $ lx.show("萌怒")
    $ lx.act(anim_shake)
    voice "cv2/linxi/linxi_0095.ogg"
    lx "别在这里发癫！"

    "她抓着我的手狠狠地摇了一摇。"
    "好吧，其实就算牵着手，也不一定就有什么变化……这种牵手方式，在外人看来，左看右看都铁定是铁得不能再铁的小情侣了，但只有我们自己心里门清，只是模拟而已。"
    "不过，既然是现实Galgame，如果不认真，那就没有意义了。"
    "玩Galgame时，要焚香、沐浴、打坐，保持着一颗婴儿般的赤子之心，这才叫真正的Gal玩家。"
    "就算是临时的、模拟的，但只要是在玩Galgame，那就是真的！"
    "今天，可是我的第一条线，我得好好引导才对。"

    cz "曦曦。"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0096.ogg"
    lx "嗯~？"

    cz "你现在是我的女朋友，对吗？"

    voice "cv2/linxi/linxi_0097.ogg"
    lx "……………………"

    $ lx.show("发情")
    voice "cv2/linxi/linxi_0098.ogg"
    lx "唉，我们现在已经是这种关系了吗？可，可是……唉？"

    cz "额，不然呢？设定不就是这样么。"

    $ lx.show("惊讶")
    voice "cv2/linxi/linxi_0099.ogg"
    lx "哦，哦——"

    $ lx.show("害羞")
    voice "cv2/linxi/linxi_0100.ogg"
    lx "我就说呢，那没错，我是你的女…女朋友……请，请注意一点哦，好好地爱护我哦？"

    "少女的双颊绯红，这样子看过来的感觉……确实，有点可爱。"

    cz "好。"

    "我只是简单回应了一句，然后牵着她的手，随意地逛着。"
    "如果是Galgame男主的话，现在，究竟会做什么呢？"
    "我陷入了沉思。"

    $ lx.show("开心")
    "看向那边，曦曦一副乐在其中的样子，好像什么事都没在想，估摸着她是指望不上了，还得是我来。"
    "要不去公园荡秋千吧……"
    "秋千可是一个神圣的地方，无数古战场的幻影叠加于此。"
    "可是不是有点太老套了。"
    "嗯，说起来，我以前不也经常和她一起出来玩吗……这么看的话……"

    $ lx.show("微笑")
    voice "cv2/linxi/linxi_0101.ogg"
    lx "哎~~？怎么一直盯着我看，终于发现我的女人味了嘛？"

    cz "或许是这样没错，但你一说出来，就完全把气氛破坏干净了啊。"

    voice "cv2/linxi/linxi_0102.ogg"
    lx "嘻嘻，那我注意。"

    cz "我就在想，我们之前不是也经常会出来玩吗？"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0103.ogg"
    lx "是这样没错。"

    cz "如果说我们现在是在约会的话……"

    voice "cv2/linxi/linxi_0104.ogg"
    lx "是在约会的话？"

    cz "额，那我们岂不是从小约会到大，每隔一阵子就时不时出来约会？\n我是这么想的。"

    $ lx.show("鼓嘴气气")
    $ lx.act(anim_shake)
    voice "cv2/linxi/linxi_0105.ogg"
    lx "怎么能这么想，不一样的。"

    cz "是吗？可我觉得，完全一样啊？？？"

    "我捏了捏手中的柔软。"

    cz "不一样的也就是我们在牵着手这件事了……但习惯了之后，好像也没怎么样。"

    $ lx.show("叹气")
    voice "cv2/linxi/linxi_0106.ogg"
    lx "这不是牵不牵手的问题啦，是心境，心境的问题。"
    voice "cv2/linxi/linxi_0107.ogg"
    lx "哎……还好，我早就知道你的性子了，还是不能指望你来……"

    cz "？"

    $ lx.show("微笑")
    voice "cv2/linxi/linxi_0108.ogg"
    lx "其实有一家店早就想和你一起去了，以前总是不好开口，来，和我走。"

    "她拢了拢我的手，靠着这额外的连接，我们之间交流的方式又多了一种。"

    cz "原来有安排的么，那早说呀，行，我跟着你。"

    voice "cv2/linxi/linxi_0109.ogg"
    lx "这边这边~"

    $ lx.hide()
    # === SDCG，恰冰激凌 ===
    show bg shopping_mall with flash
    show sdcg 014 with dissolve
    
    voice "cv2/linxi/linxi_0110.ogg"
    lx "噔噔噔咚~情侣款双头冰激凌！好耶~"
    "没想到，曦曦居然径直牵着我，来到了一家甜品店。"
    "买的是一个双头冰激淋，情侣款，很贵……"
    "拿到手上后，我们就在商场里漫无目的地逛着。"
    voice "cv2/linxi/linxi_0111.ogg"
    lx "怎么样怎么样~爱心哎，明明是一个杯子，但是却有两个口哦？好吃么好吃么~"

    cz "……不赖。"

    voice "cv2/linxi/linxi_0112.ogg"
    lx "我还不了解你嘛？明明感觉很好吃~哼。"

    "就是这一点瞒不过她啊。"

    show sdcg 015 with dissolve
    voice "cv2/linxi/linxi_0113.ogg"
    lx "能看到你这么喜欢吃，我就很开心了，啊呜~"

    "说着说着，她也吃了她那边的一口。"
    "现在的商家真是会搞营销，这情侣冰激凌虽然有两个头，但价格却比单独买两个还贵，总有种被宰了的感觉。"
    "……不过，味道的确不错就是了。"

    show sdcg 017 with dissolve
    voice "cv2/linxi/linxi_0114.ogg"
    lx "啊~你停一下，先别动。"

    cz "嗯？"

    "曦曦整个人都贴了过来，随后，把手伸到了我的嘴边。"
    "她的手指轻轻地拂过我的嘴角。"

    voice "cv2/linxi/linxi_0115.ogg"
    lx "有渣子留在上面了。"

    play sound fx.heartbeat
    "咚咚——感觉心脏在跳动。"

    show sdcg 015 with dissolve
    voice "cv2/linxi/linxi_0116.ogg"
    lx "~~♪"

    "她倒是在自顾自地哼着小曲，时不时抿一口她那侧的冰激凌。"
    "一贴过来……就没离开了。"
    "我能感受到曦曦的温度，混合着冰激凌的甜香味沁入了我的身体里。"

    "胳膊贴着我的胳膊，温度透过薄薄的衣料传过来。"
    "我感到有些不好意思，于是松开了手走开几步……结果没两秒她就蹭到了我边上，又牵住了我的手，这回换了一边，凉丝丝的指尖自然地滑入我的指缝，扣住。"
    "我没招了。"
    "只能这样，被拽着往前。"

    show sdcg 016 with dissolve
    "经过明亮的橱窗时，她的目光被里面陈列的裙子吸引过去，驻足停看，她看裙子，我则没什么好看的，只能望着人流……"
    "……"
    "只不过，她映在店铺玻璃上的侧影，还是一不小心把我的目光给吸引到了那边……"
    "可以看到，曦曦的睫毛上似乎还沾着一点商场顶灯洒下的碎光。"
    "看了片刻，她转过脸，正好对上我的视线。"
    cz "……"
    "……"
    "曦曦也不说话，只是把被我握着的手轻轻晃了晃，然后拉着我继续往前走。"
    "我总觉得我应该说两句话，免得她误会，虽然我也不清楚她能误会什么吧……可我就是不想被这份温暖的沉默所笼罩。"
    "这真的是我自己的意志么？\n总之，我自己都不知道为什么，张嘴说出的话，也不清楚是不是我想说的……"

    cz "好不可思议啊。"
    "曦曦看了过来。"

    cz "真的有种在交往的感觉……"
    
    show sdcg 018 with dissolve
    voice "cv2/linxi/linxi_0117.ogg"
    lx "嘿~真的嘛，意思就是，你发自真心把我当成女孩子看了？呼呼呼。"

    cz "要说的话，昨天开始我就认识到了…都怕以后变不回去了……"

    voice "cv2/linxi/linxi_0118.ogg"
    lx "对自己这么没信心啊，那我这样的话，看你怎么办……"

    show sdcg 014 with dissolve
    voice "cv2/linxi/linxi_0119.ogg"
    lx "——看招~"

    "她给我手上拿着的冰激凌抢了过去。"

    cz "……唔，在谁手上不都一样吗，毕竟它有两个头，就是这么吃的，你还不如……"

    "我话还没说完，她就把整个冰激凌调换了方向。"

    voice "cv2/linxi/linxi_0120.ogg"
    lx "啊呜~嗯……"

    cz "哎？那是，我、我的。"

    voice "cv2/linxi/linxi_0121.ogg"
    lx "什么你的我的，你的就是我的，你那边不是还有吗？继续吃不就行了~哼~"

    "可，可现在位于我这边的这个头……是，是曦曦……刚刚吃过的……"

    voice "cv2/linxi/linxi_0122.ogg"
    lx "有没有心动？有没有心动~？还是说，这就已经顶不住了？"

    cz "………………"
    cz "不会啊？这很普通啊？我完全没有一点问题。"

    "不行，我作为男人的尊严不能放弃，比这更重要的是…我现在可是现实Galgame的男主，作为男主，一定不能说不行。"

    cz "……啊呜。"

    "我顶着她带有热量的目光，吃了一口……总感觉，该有的冰凉并没有发挥出多大效用，反而让我有种身体温度上升了的错觉。"

    voice "cv2/linxi/linxi_0123.ogg"
    lx "……怎么样。"

    cz "嗯……马马虎虎吧。"

    voice "cv2/linxi/linxi_0124.ogg"
    lx "嘻嘻嘻~"

    hide sdcg with dissolve
    "她的笑容，让我体内的温度再度升高了些许，所以，为了降温，我继续吃了一口。"

    $ lx.show("开心")
    voice "cv2/linxi/linxi_0125.ogg"
    lx "这样的经历，以前我想都不敢想啊……\n你知道吗，其实我现在，心脏一直噔~噔~地在跳。"
    voice "cv2/linxi/linxi_0126.ogg"
    lx "你怎么样，多少也该认识到我的魅力了吧，嗯？"

    cz "大，大概？不是很清楚呢。"

    $ lx.show("闭眼微笑")
    voice "cv2/linxi/linxi_0127.ogg"
    lx "嘻嘻，嘻嘻嘻。"

    "我有点害怕，想尽快逃离这种氛围。"
    "眼前的少女身上有着奇异的魔力，能将我整个人的注意力全部牵扯过去，我怕真的，就这么忘了一切，沉溺其中，然后一不小心做出出格的事。"

    cz "对了曦曦，我们去Gal体验店吧？\n我好像从来没有和……和女朋友一起去过那个地方。"

    $ lx.show("微笑")
    voice "cv2/linxi/linxi_0128.ogg"
    lx "唉——？有这么可爱的曦曦陪着你，你还不满足，还要去找二次元里的女人排解寂寞。"
    
    $ lx.show("哭哭")
    voice "cv2/linxi/linxi_0129.ogg"
    lx "我家的男朋友居然是这样一个三心二意的超级大渣男，呜呜呜。"

    cz "啊，那，那不去了……"

    $ lx.show("开心")
    voice "cv2/linxi/linxi_0130.ogg"
    lx "可是，满足丈夫的任性请求也是妻子工作的一环，没办法呀，既然你想去的话，我陪你一起去。"
    voice "cv2/linxi/linxi_0131.ogg"
    lx "我倒要看看，是她们可爱，还是我更可爱一点。"

    cz "……"

    "怎么有种，自己已经被她压制了的感觉。"
    "是这样吗？唉？原来我和曦曦的交往模式，是这样子的一个路数？"
    "不对不对不对不对，肯定不是这样的，明明平时都能和她互相有来有回地交锋，怎么一到模拟恋爱上，就好像成了是她游刃有余一样？我成鹌鹑了？"
    "不可能，一定不可能……我要…逆转！"
    "恋爱的主导权，应该是要在我的手上才对。"

    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    show bg box_seat with dissolve

    play music "audio/bgm/BGM_日常6.ogg" loop fadein 1.0
    
    "我们在网上购完票，没经过什么折腾就来到了Gal体验店。"

    $ lx.show("无语", pos=center)
    voice "cv2/linxi/linxi_0132.ogg"
    lx "话说，我早就想吐槽了……舟子啊，这个世界是不是有点太奇怪了。"

    cz "嗯？"

    voice "cv2/linxi/linxi_0133.ogg"
    lx "没什么…只是第一次来这所谓的「Galgame体验馆」，所以感到有些心情复杂而已……"
    $ lx.show("忧伤")
    voice "cv2/linxi/linxi_0134.ogg"
    lx "虽然站在我的角度来说，光是以Galgame水平来决定人们的阶级什么的，就足够莫名其妙就是了……"

    cz "额，你的想法我也不是不能理解，但是怎么说呢，"
    cz "这个世界就是这样的，自古以来懂吧，自古以来，没办法。"

    $ lx.show("叹气")
    voice "cv2/linxi/linxi_0135.ogg"
    lx "唉，说是这么说，emmm，然后呢？你是要玩什么？这个包厢的条件倒是还不错。"

    "确实，眼前这台主机，是目前被圈内称为「Galgame旗舰配置」的顶级机种。"
    "它搭载了最新一代的 GAX 0721 —— Galgame Advanced eXpression图形加速卡。GAX架构最著名的特性，就是角色立绘表情420Hz超频渲染，几乎能把所有Galgame的分帧表情变化推到肉眼无法捕捉的极限。"
    "凭借这一代的表情链路加速器（ELA），GAX 0721在同级产品里完全没有对手。上市以来价格一直居高不下，甚至因为产能不足，销售得非常贵，还经常抢不到货。"
    "不错，居然有这样的配置，确实不错！"

    $ lx.show("白眼")
    voice "cv2/linxi/linxi_0136.ogg"
    lx "……怎么感觉，你和我牵手手的时候，都没有这么开心。"

    cz "咳，咳咳，那能一样吗？"
    cz "对了，咱们一起玩吧，这么多新的游戏，我一个人玩多没意思，遇到困难选项，或者好感度要求之类的，我来指导你！"

    "哼哼哼哼，我可是要立志成为Galgame领域大神的男人。"
    "那些个普普通通的游戏，我就算凭直觉都能搞定。"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0137.ogg"
    lx "哦，那我来咯，其实我也是玩了一些废萌的，不用你来教我。"

    # 黑屏切换 1
    $ lx.hide()
    show bg white with dissolve
    "……一段时间后。"
    show bg box_seat with flash
    $ lx.show("欲言又止")
    voice "cv2/linxi/linxi_0138.ogg"
    lx "哎？还要删除文件？这么麻烦的。"
    cz "对啊，它会扫描检测本地储存，除非你安装了一些更流氓的东西……"

    # 黑屏切换 2
    $ lx.hide()
    show bg white with dissolve
    show bg box_seat with flash
    $ lx.show("惊讶")
    voice "cv2/linxi/linxi_0139.ogg"
    lx "抑制黑波动的源头？这……这，怎么办？"
    cz "根据我谨慎的分析，我觉得应该选第三行的第一个，你有什么别的想法么？"
    $ lx.show("平静")
    voice "cv2/linxi/linxi_0140.ogg"
    lx "哦，哦哦，那先这样选吧。"

    # 黑屏切换 3
    $ lx.hide()
    show bg white with dissolve
    show bg box_seat with flash
    cz "积极妄想，肯定是先积极妄想啊？"
    $ lx.show("萌怒")
    voice "cv2/linxi/linxi_0141.ogg"
    lx "不对，不对！这里肯定是消极妄想！我都进同一条线路三次了，这回肯定不信你的了！"
    cz "是，是吗？"

    # 黑屏切换 4
    $ lx.hide()
    show bg white with dissolve
    show bg box_seat with flash
    $ lx.show("哭哭")
    voice "cv2/linxi/linxi_0142.ogg"
    lx "为、为什么？去音乐会……点不了……呜呜呜。"
    cz "emmm，别急，这里我觉得应该是一个小Trick，来，让我操作。"
    
    voice "cv2/linxi/linxi_0143.ogg"
    lx "嗯，好的。"
    "……一顿操作后。"
    $ lx.show("开心")
    voice "cv2/linxi/linxi_0144.ogg"
    lx "哇真的能选了，好厉害！"
    cz "哈！还得是我。"

    # 黑屏切换 5
    $ lx.hide()
    show bg white with dissolve
    show bg box_seat with flash
    $ lx.show("无语")
    voice "cv2/linxi/linxi_0145.ogg"
    lx "额，怎么还要做数独啊，真下头。"
    "曦曦看着屏幕上足足五阶层的矩阵，满眼嫌弃。"
    cz "什么狗屁玩意，也敢来做Galgame了？！"
    "我也不遑多让。"
    "奶奶的，亵渎旮旯的家伙！"
    "……"

    # BGM切换 暧昧
    $ lx.hide()
    show bg white with dissolve
    play music "audio/bgm/BGM_抒情.ogg" loop fadein 1.0
    show bg box_seat with dissolve
    
    $ lx.show("叹气", pos=right, x_offset=-250)
    voice "cv2/linxi/linxi_0146.ogg"
    lx "啊……好累哦……"

    "我让双手离开桌面，往后靠着背，软软的沙发给了我坚实的支撑。"

    cz "先休息一下。"

    "感觉不错，这下子，总算是又回到以前那种的氛围了。"

    cz "怎么样，感觉如何，Galgame体验馆？"

    $ lx.show("微笑")
    voice "cv2/linxi/linxi_0147.ogg"
    lx "有你陪着我的话，还不算差吧。"

    "少女乖巧地坐在我旁边，可能也是累了，她出了点汗，用手拨着自己的头发，简直就是在专门把她那细白的脖颈给展示出来似的。"
    "说起来，如果只是回到均势的程度，那我还是气不过啊。"
    "不行，我要让林曦这家伙也体验一下那种害羞的感觉，报我的一箭之仇。"

    cz "曦曦。"

    $ lx.show("惊讶")
    voice "cv2/linxi/linxi_0148.ogg"
    lx "嗯~……唉？"

    "她一脸不可置信的表情，因为，她感受到了我的动作。"
    "我贴着沙发面，在底下把手指划入了她的指尖，轻轻扣住，往上带起。"
    "——然后，往前一推。"

    
    $ lx.show("发情")
    play sound fx.kabe_don
    "简直就像是没有骨头一般，她被我这么一带，就向后倒去，背靠在了墙上。而我的手也是扣住她的手，被我一同抵在了墙面。"

    voice "cv2/linxi/linxi_0149.ogg"
    lx "嗯呢……"

    "这可是……我从Galgame里学来的招式：壁咚！"

    $ lx.show("发情", zoom=2, transition=dissolve,  y_offset=1900)

    "我的身体把她逼到角落，一只手扣着她的手，让她无法挣脱，然后整个人将其笼罩住。"
    "呵呵，果不其然，曦曦的脸一下就红了起来。"

    voice "cv2/linxi/linxi_0150.ogg"
    lx "喂……那，那个，你……你要干嘛……"

    cz "你猜。"

    "我不再言语，只是慢慢地将脸靠近。"

    voice "cv2/linxi/linxi_0151.ogg"
    lx "噫~其实，不是，我我，我……还没有……"

    "看她还要说话，我直接抬起另一只手，把她脸前的头发丝捏起，向下拂弄着，手指关节不小心碰到了她的脸颊，好软，好烫。"

    voice "cv2/linxi/linxi_0152.ogg"
    lx "啊呜……"

    "只消这么一下，曦曦便如幼猫一般软了下来，整个眸子里都溢满了水珠，不再说出任何话。"
    "我决定……"

    $ lx.reset_position()
    $ lx.show("发情", pos=center)
    "把她的手松开。"

    # BGM切换 快乐
    play music "audio/bgm/BGM_欢快.ogg" loop fadein 1.0

    cz "哈，怎么样？！有没有心动感，肯定有了吧！"

    "计谋还是被我得逞了吧，哈哈哈，就像新年穿上了新的内裤一样，这种舒畅感让我情不自禁笑了出来。"
    "松开手后，接着，我离开了她的跟前。"

    $ lx.show("平静带怒")
    cz "哎呀，能看到你这样的表情，真是此生无憾了。"

    "不得不说，其实刚刚靠近过去的那一刹那，我甚至生出了再靠近一点的冲动……但是，要是再靠近，可能就真的危险了，毕竟我也是男孩子，所以还好还好，没有任凭心中所想行事。"
    "模拟终究是模拟，要是真的一不小心没弄好，冲动了，事后可不好解释……我可不想被人嫌弃呀。"
    "不过，这可不代表我就没有别的方法去调戏她。"
    "嘿嘿嘿，我还有的是招。"

    cz "对了对了，说起来我手机呢，要不还是拍张照吧，作个纪念，曦曦你现在确实很可爱啊，我都控制不住了。"

    $ lx.hide()
    "我把手深入口袋，低下头，然后掏出手机。"
    "而就在这时，我完全没有想到，身侧居然传来一股力气。"

    show bg white with flash
    stop music fadeout 1.0


    play sound fx.fabric_collision
    "这力气如此之大，使我一不小心朝沙发倒去。"
    

    # 【要有一张CG，这张是必备CG】
    
    cz "唉？"

    play music "audio/bgm/BGM_抒情.ogg" loop fadein 2.0
    show cg 004 with dissolve
    "……"
    "一瞬间，脑子完全短路了。"
    "这，她？我？\n什么……情况？"
    "我，现在？"
    "——被推倒了？"
    "哎？"
    "是这样吗？"
    "顶灯的白光从她的发丝边缘落下，照映进我的瞳孔里，曦曦把我推倒在沙发上，整个人都撑在我的上面。"

    voice "cv2/linxi/linxi_0153.ogg"
    lx "嗯……都怪你哦，你的曦曦…可能忍不住了。"

    "还没消化完这句话，就感觉到有一只手被她捏起，无比顺利地被带动着，十指交融，缠在一起，亲密无间。"
    "这一刻，错觉一般，我听到了她在微微喘息的声音。"
    "皮肤在剥落，血液在逆流，看到这样一双眼睛，我、思考到了，所以，在已经思考到的情况下，我、完全丧失了全身的抵挡力气。"
    "只能拼尽全力…嘟囔出一句话来。"

    cz "……这个，是什么恶作剧……吗?"

    voice "cv2/linxi/linxi_0154.ogg"
    lx "不是。"

    "我明明尝试着说出了最没有情商的话，这也是我从Galgame里学来的，但是……但是？为什么，不起作用呢，和我想象的，完全不一样。"

    cz "……那、那？那这个情况是？"

    voice "cv2/linxi/linxi_0155.ogg"
    lx "你不推开我的话，我就继续了。"

    "指尖贴合着指尖，带有着指甲的微微剐蹭感。"
    "她的几缕头发因为姿势的问题垂到我的脸上，让我有些痒痒的。"
    "我闻到了她的洗发水味，温暖，安心，不可思议地让我觉得，这似乎是她的体香。"
    "——或许，真的就是呢？"
    "我的身体从上到下，从里到外，仿佛一切都被涤荡干净，然后塞入了名为林曦的填充物，靠得如此之近，这个女孩子的存在感，完全地……将我吞没。"

    voice "cv2/linxi/linxi_0156.ogg"
    lx "喂…我是你的……女朋友吧……"

    "她向我靠近着。"

    cz "是…这样没错，现实Gal…在走你的线来着……"

    "借着说话的机会，我咽下了一口口水…我不想被她知道。"

    voice "cv2/linxi/linxi_0157.ogg"
    lx "说，喜欢我。"

    cz "哎？"

    voice "cv2/linxi/linxi_0158.ogg"
    lx "我想听听你说……喜欢我。"

    "没有任何逃离的余地，她的眼神，她的言语，从手心传来的温度，每一个都在向我表达这个要求。"

    cz "……"
    cz "嗯……那，那行。"
    "说说话而已，也不会少块肉……"

    cz "那，曦曦……我喜欢你。"

    "十指相合的手掌传来了被握紧的力度，然后——"

    voice "cv2/linxi/linxi_0159.ogg"
    lx "再说一遍。"

    cz "……我喜欢你。"

    "她整个人趴了下来，贴合在我的身上，惊人的柔软于我胸前荡开。"
    "意料之外的压迫——"
    "更甚于此的，是我感受到了眼前名为「林曦」的存在，仿佛将她的一切都托付给了我。"

    voice "cv2/linxi/linxi_0160.ogg"
    lx "……再说一遍。"

    "而我，就连感受她的时间都不存在。"

    cz "喜欢你……"

    voice "cv2/linxi/linxi_0161.ogg"
    lx "嗯。"

    "她笑了。"

    cz "……好赖皮啊，怎么只有我在单方面说……"

    "我已经，完全不知道自己在说什么了。"
    "反正，现在，我的眼前、我的脑海、我的心里，于现在这一刻，除了她以外，什么都不存在。"

    voice "cv2/linxi/linxi_0162.ogg"
    lx "呼呼，我也觉得，有点赖皮呢……"
    voice "cv2/linxi/linxi_0163.ogg"
    lx "所以…不要动……"

    "靠近着，"
    "靠近着。"
    "曦曦的眼瞳里只映着我、将我深锁其中，对我细语呢喃\n……我完全，被她俘虏了。"
    "逻辑思考的回路，寸寸崩坏。"

    voice "cv2/linxi/linxi_0164.ogg"
    lx "……"

    "她的脸蛋红得能够滴出血来，身体微微颤抖着，小嘴微张，从我的角度，能清晰地看到小小嘴唇内，更里面的颜色——"
    "直到，她就真的，这么靠近了我。"
    "直到，能感受到，她嘴唇中呼出的湿气。"

    # 黑屏，关BGM
    stop music fadeout 1.0
    scene black with Dissolve(1.5)

    "直到，整个视野，都被发丝覆盖。"

    voice "cv2/linxi/linxi_0165.ogg"
    lx "嘶……"

    "黑暗中，她温热的气息如羽毛般搔刮着我的耳际，随即便是湿热的、带着轻微力道的什么东西落在了我的耳垂上。"

    voice "cv2/linxi/linxi_0166.ogg"
    lx "……啾。"
    "意识飘飞，身体僵直。"
    "整个世界的声音仿佛都消失了。"
    "只有令人心悸的嗡鸣声，直冲大脑。"
    "不知多久后，我听见了沙沙的声音。"
    "是少女改变了紧贴的姿势，离开时，头发剐蹭我衣服的声音。"
    "而就连这，我都没能反应过来……"
    "只有耳垂上，仿佛要将我点燃的热量，在灼灼地烤着我的灵魂。"
    "直到，视野再次，被光流吞没。"

    # 黑屏取消
    show cg 005 with dissolve
    play music "audio/bgm/BGM_黑暗悲伤.ogg" loop fadein 1.0

    cz "……"

    "温暖的灯光洒下，和少女的脸交叠在一起，将其映成惨白。"
    cz "……"
    "我沉默了。"
    "仿佛是被冷水从头浇到了脚底板，鉴于现在是这个姿势，所以，或许是一种摔倒在冰凉水坑中的感觉。"

    
    voice "cv2/linxi/linxi_0167.ogg"
    lx "我…可不能做这种事呢……毕竟，你…是有真正的女友的……"
    "……小、涟……"
    "她的话语间带着宛如来自深远过往的沉痛伤痕，我被她震慑住了。"
    "被她眼瞳里满溢的，眼看就要化为泪水滴落的哀恸给震慑住。"

    cz "曦曦……"

    "身体明明靠得很近，却感觉两人之间的距离，有一个世界那么长。"
    "咦？"
    "从什么时候起，变成这样的。"
    "我做了什么吗，还是说，我无意间造成了什么吗。"
    "到底是……"

    voice "cv2/linxi/linxi_0168.ogg"
    lx "今天，听到你说喜欢…我其实有点……心动的……\n所以，应该，以后很难…忘记了吧……"

    "她的声音断断续续，切开了我即将出口的所有言辞，想要说的事、不知道该怎么说的事，通通混杂起来，玻璃碎片一样被吞进胃里。"
    "溺水一般，全身的热量都在失去。"
    "只剩下耳垂边缘所残留的一点点湿润，顽强地散发着余温。"

    # === 街道（黄昏） ===
    show cinematic_black_overlay
    $ renpy.pause(3.0, hard=True)
    scene black
    show bg street1_2 with dissolve

    "那之后，我们出来吃了晚饭。"
    "就好像什么都没发生一样。"
    "唯一不同的是，手已经没有牵在一起了。"

    $ lx.show("平静", pos=center)
    voice "cv2/linxi/linxi_0169.ogg"
    lx "啊，对了，我能不能去趟你家？"

    cz "可以是可以，不过怎么突然说这个。"

    voice "cv2/linxi/linxi_0170.ogg"
    lx "今天的约会，还挺开心的哎，好像没什么遗憾了，所以，就想着去看一看，找下回忆。"

    cz "这样吗，好吧，那反正也吃饱喝足了，我家也不远，坐一坐休息休息也挺好。"

    "之前隔三差五也会去，有什么回不回忆的？"
    "她的话语让我觉得有些莫名其妙，但是现在的我，也不想去考虑什么事了。"
    "算了吧，该怎么样，就怎么样了……"

    # === 家（夜） ===
    show bg room1_4 with dissolve

    voice "cv2/linxi/linxi_0171.ogg"
    lx "打扰咯。"

    "我和曦曦顺利的回到了家里。"
    "虽然这么说，我家也就我一个人罢了……当然，还有小涟。"

    # 立绘出现：小涟
    $ xl.show("温柔", pos=left)
    "她只是笑着向我挥了挥手，并没有搭话。"
    $ xl.hide()

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0172.ogg"
    lx "那个…小涟也在？"

    cz "是没错。"

    "这是小涟和我的默契，只要别人来到我家里，和小涟共处一室，她就会默默退到一旁，尽量不打扰我。"
    "毕竟……"

    voice "cv2/linxi/linxi_0173.ogg"
    lx "可惜…我看不见。"

    cz "嗯……"

    "曦曦听不到小涟说话。"
    "这个世界上，能听到小涟、能见到小涟、能摸到小涟的，只有我。"


    voice "cv2/linxi/linxi_0174.ogg"
    lx "自从晚晴来了后，这还是我第一次过来。"

    cz "这么一说，确实是呢。"
    "话说，晚晴？"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0175.ogg"
    lx "呼啊~~所以才怀念啊，说起来，你的电脑桌，我们当时还一起天天在这里研究Galgame呢……"
    voice "cv2/linxi/linxi_0176.1.ogg"
    lx "虽然我是没起到什么作用就是了。"

    cz "你怀念的话，那我们俩现在就可以一起玩啊。"
    "不如说今天已经一起玩过了吧，在Galgame体验馆里。"

    $ lx.show("忧伤") # 落寞
    voice "cv2/linxi/linxi_0176.ogg"
    lx "呵呵呵，没有必要了。"

    "她……不复平日间的活力，只给我一种浸泡在冰水里的感觉，曦曦眼神里流露出来的，语气里渗透而出的，让她整个存在都离我很远。"

    # 闪回
    show layer master at memory_filter
    show cg 005 with dissolve
    "一瞬间，我又回想起了那时曦曦的样子。"
    "少女仿佛要融化在灯光里——"
    hide cg
    show layer master at reset_filter

    # show bg room1_4 with dissolve
    $ lx.show("平静带怒")
    voice "cv2/linxi/linxi_0177.ogg"
    lx "三年前。"

    "忽然间，她就提到了那时候的事。"

    voice "cv2/linxi/linxi_0178.ogg"
    lx "三年前，你出了车祸，被诊断为认知功能受损。"

    "话语有些冰凉。"

    cz "……是的。"

    voice "cv2/linxi/linxi_0179.ogg"
    lx "自那以后，你就能看到小涟了吧。"

    "冰凉而熟悉的声音，此刻却宛如审判。"

    cz "……是的。"

    "我知道…她要说什么，但是，但是…这些都是……"
    "如果没有小涟的话……"

    $ lx.show("忧伤")
    voice "cv2/linxi/linxi_0180.ogg"
    lx "我…是看不到的哦？\n……喂，小涟，你在吗？是在我的旁边？还是在他的旁边？呵呵，呵呵呵。"

    "空洞地呼喊，注定不可能有应答。"

    voice "cv2/linxi/linxi_0181.ogg"
    lx "不管在哪，没有的就是没有啊。"

    voice "cv2/linxi/linxi_0182.ogg"
    lx "我真的真的，真的真的，很难过……已经三年了，还是，看不到希望……"

    $ lx.show("忧伤", pos=center, x_offset=0, zoom=2, transition=dissolve,  y_offset=1900)
    "她靠近了我。"
    "然后，抱住了我。"
    "自己的身体宛如一座木桩，哪里都动不了。"

    voice "cv2/linxi/linxi_0183.ogg"
    lx "我不想你再看着那边了……"
    voice "cv2/linxi/linxi_0184.ogg"
    lx "小涟…是不存在的，不管你怎么证明，都不存在。"

    "感受着少女的拥抱，听着她那含混不清的呢喃，\n我第一次，第一次感受到了——心疼。"

    voice "cv2/linxi/linxi_0185.ogg"
    lx "沟通神明，实现愿望…那种事情，在这个世界，怎么可能有啊……"
    voice "cv2/linxi/linxi_0186.ogg"
    lx "求求你，不要再…骗自己了……"

    "我什么都说不出来。"
    "甚至没有力量，反抱回去。"

    voice "cv2/linxi/linxi_0187.ogg"
    lx "看一看周围的人吧，看一看……我吧。"

    # 打雷
    play sound fx.thunder
    "要下雨了，我看向窗外，突然想到。"
    "如果能下一场大到把全世界都染成灰色的雷阵雨，掩盖掉所有的声音让我什么都听不见，将里面的外面的一切都冲刷掉，就好了。"

    $ lx.show("微笑") 
    voice "cv2/linxi/linxi_0188.ogg"
    lx "今天……我真的好开心，好开心。"

    "她松开了我。"

    voice "cv2/linxi/linxi_0189.ogg"
    lx "所以，我下决定了。"

    "少女澄澈的瞳孔将我牢牢定在原地。"
    "那是一湖渊深的湖水，我甚至能透过她的眼瞳，见到其内蕴藏的幽蓝火焰。"
    "幽蓝色的火焰，是远比赤红火焰更加灼人的存在，它就在那儿，静静燃烧着。"

    voice "cv2/linxi/linxi_0190.ogg"
    lx "下个周末，我要对你说很重要、很重要的话，不是作为青梅竹马，是我作为林曦，作为曦曦，作为一个少女……一直都，想对你说的话。"

    cz "……"

    $ lx.show("闭眼微笑") 
    "她露出了一个，称不上是笑的笑容。"

    voice "cv2/linxi/linxi_0191.ogg"
    lx "如果神明真的存在……请务必让我，得偿所愿……"
    voice "cv2/linxi/linxi_0192.ogg"
    lx "如果我的愿望，没有传达到那边的话……"

    $ lx.show("微笑") 
    "她是在对着神明说话吗？可她分明在看着我。"

    voice "cv2/linxi/linxi_0193.ogg"
    lx "这一次，我肯定能释怀了。"

    "她究竟在祈求着什么样的回应呢？"
    "我不知道，我只是忽然有一种，稍有不慎，就要失去曦曦的错觉。"

    $ lx.hide()
    "——僵硬。"
    "我的身体自四肢指尖起逐步变得僵硬。"
    "直到她因为下雨而离开我家，我都没能做出任何像样的回应。"
    "咦，不对吧？我？会失去林曦？"
    "林曦，曦曦……有记忆起，就一直陪伴在我身边的她。"
    "从小到大，整天日夜相伴，绝不会怀疑的她。"
    "那个和我默契十足，心心相通的她。"
    "我，有可能会失去她？"
    "先前，江晚晴说的话，在我心头复苏。"
    "——如果说，进入小涟线的代价，是让她离我而去。"
    "……"
    "光是想象，都难以接受。"
    "窗外的雨点声渐渐变大，像是掉在了我的心脏上，肉里有着被针刺着的错觉。"
    "说起来，曦曦打伞了吗？"
    "我靠在墙边，汗流浃背的身体感到了一阵寒意，自背后贴着墙壁的衣服所传来的，是黏腻的恶心感。"
    "我不想…我不想…………"
    "这种事情，我从来没有……把整个宇宙都反转过来，我都没想过可能会有这种未来。"
    "下周，下周……"
    "下周会发生什么？"
    "下周肯定会发生什么。"
    "我应该，怎么办。"
    "如果，我没能给出，真正的、来自我心底的回答。"
    "——我真的会失去她。"

    stop music fadeout 3.0
    play sound fx.thunder2
    show cinematic_black_overlay
    $ renpy.pause(3.0, hard=True)
    
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ lx.reset_position()
    $ jwq.reset_position()
    $ xl.reset_position()
    return