label scene_2_4:

    play music "audio/bgm/BGM_忧郁2.ogg" loop fadein 1.0
    play sound fx.light_rain loop
    scene bg room1_4 with dissolve

    "……"
    "我坐在地上，背靠着床。"
    "雨点泼打着半开的窗，有几滴雨水溅到了我的手臂上。"

    cz "小涟……曦曦……"

    "喃喃着一些没有意义的词语，我整理着往下坠落的思绪，如果可以的话，就这么埋入被子，大梦一场多好。"
    "只是，我更无法逃避。"
    "小涟……"
    "我明明是，这么爱着小涟，怎么可能，让我背叛她……我不想选择，没有小涟的未来。"
    "但是…曦曦……"

    cz "小涟。"

    "低低的呼喊，没能给这片空间带来任何涟漪。"

    $ xl.show("温柔", pos=right, zoom=0.5, y_offset=-850, x_offset=-300)
    "小涟只是远远地看着我，没有半点想要过来安慰我的样子。"
    "……我早就知道的。"
    "小涟虽然非常可爱，抱起来也非常软，每次伤心的时候，都会用无限大的包容来抚慰我，但是，一旦遇到真正的需要我去决定的事情，她比谁都严厉。"
    "她真的是一个，非常非常……优秀的妻子。"
    "我的挚爱，小涟。"
    "被她用这样子的目光看着，这不就，不得不振作起来了吗。"
    "谢谢你。"
    "——天选试。"
    "是的，只有这个，天选试，是一定，一定要通过的。"
    "只要能去往殿试……不对，只要能踏上天选台，\n那就什么都，什么都不用放弃了。"
    "这可是小涟和我说的，而且……也有流传至今的传说佐证……"
    "除此之外，已经没有……"

    $ xl.hide()
    cz "呼——"

    "我长出了一口气。"
    "随后，猛地一起身。"

    with hpunch
    cz "嘿呀！"

    "人就是需要一些仪式感来鼓舞自己，动作也好，言语也好，这能让人获得力量。"
    "必须要投入到学习中，就像以前一样。"
    "只有努力是不可能背叛自己的。"
    "我决定把窗子关掉，专心用功，玩Galgame。"
    "两步走到窗边，我猛地关上窗户，试图隔绝外面哗哗的雨声。"
    "而就在窗户合拢的瞬间，我的目光像被什么无形的东西箍住了。"

    scene black
    show rainback scroll
    with flash

    pause 0.5
    stop music fadeout 1.0

    "——唉？"
    "这，这是？"
    "什么……情况…………"

    $ jwq.show("空洞")
    show rainfront scroll
    "那里有一个少女，她直挺挺地站在雨中，身边什么都没有，被整个世界遗忘。"
    "头发湿漉漉地全贴在脸颊和脖子上，雨水顺着发梢不停地往下淌。那件上衣紧紧裹在身上，显出单薄的轮廓。"
    "她一动不动，就那么仰着头，视线穿透密集的雨线，牢牢地看着我所在的这扇窗户——或者说，看着我。"

    cz "江……晚晴？"

    "异样的光景，让我的大脑一瞬没能回过神来。"
    "我凭直觉就能清楚，这不是偶然路过，绝对不是。"
    "她的样子，像是已经在雨里站了很久很久，久到对砸在身上的冷雨和不时滚过的闷雷都浑然不觉。"
    "空洞洞的眼神……直直地投向我。"
    "楼下灰蒙蒙一片，只有她那个小小的身影清晰、突兀。"

    # （这里可以插两句回忆？届时调演出的时候权衡一下）
    $ jwq.hide()
    "不行，绝对不能就这样让她呆在雨里。"
    stop sound
    play sound fx.rainstorm loop
    scene bg neighborhood
    show rainback scroll

    play music "audio/bgm/BGM_悲伤八音盒.ogg" loop fadein 2.0

    "我带着两把伞，拖鞋也来不及换就冲出了家门。"
    "但我错了，外面的雨比我想象得要大一点。"
    "刚刚江晚晴那个位置在楼的后面，我还要绕个一段距离，光是这么一会就感觉身上已经湿了大半，我明明撑着伞的。"
    "冰冷的雨点砸在身上，我顾不了那么多，转动着头，用视线穿透雨幕寻找那个身影。"

    $ jwq.show("空洞", pos=center, zoom=0.5, y_offset=-1050)
    show rainfront scroll
    "她还站在那儿，位置没变，只是在我狂奔下楼这短短片刻，她似乎更湿透了，身影显得更加伶仃脆弱。"

    cz "喂！喂，你在这里干什么！"

    "我对她大喊，声音在雨声里显得有点嘶哑，这个距离肯定是能听见的。"
    "可她却只是缓缓地把视线从我家窗户处转了过来，看向了我，显得非常迷茫，完全没有下一步的动作。我甚至能听到雨水打在她身上细微的声响。"

    cz "别在这里傻站着啊，旁边有个凉亭，走走走！"

    "我也懒得给她伞了，这都湿透了还打个什么。"

    $ jwq.reset_position()
    $ jwq.show("空洞")
    "见江晚晴呆呆的，没有反应，我干脆踩着水坑冲到她面前，伸出手拉住她的手臂，往旁边的凉亭里走去。"
    "我握紧五指，带着她走，结果我没能想到，她却猛地把手往后用力一收。"

    cz "唉？"

    "然后，在我转过身子去看向她的时候——"

    $ jwq.show("空洞", pos=center, x_offset=0, zoom=2, transition=dissolve, y_offset=2100)
    "抱了过来。"
    "她就这么，抱了过来。"
    "紧紧地，身体完全贴合着地，在雨中抱了过来。"

    "这个力气是如此的大，抱得如此紧，以至于我手上原本撑着的伞，都掉在了地上。"
    "瞬间，冰冷的雨水浇透了衣裤。"
    "两个湿漉漉的人，在滂沱大雨里，面对面拥抱着……不，不对，是我单方面被她拥抱着。"

    cz "这是？江晚晴？怎么回事？"

    "被雨一浇，我实在是懵了，完全不了解她的用意。"

    $ jwq.show("空洞2")
    voice "cv2/jiangwanqing/jiangwanqing_0132.ogg"
    jwq "……"
    voice "cv2/jiangwanqing/jiangwanqing_0133.ogg"
    jwq "我还是…忍不了……"

    cz "忍不了？什么意思。"
    cz "先别说了吧，现在这个季节，天气虽然不冷，但淋了雨，被风一吹，肯定会感冒的。"

    voice "cv2/jiangwanqing/jiangwanqing_0134.ogg"
    jwq "就让我感冒吧……一起。"

    cz "哈？"

    "她的声音陡然激动起来，把脸埋在我的胸口上，我推也不是，不推也不是。"

    voice "cv2/jiangwanqing/jiangwanqing_0135.ogg"
    jwq "只要和你在一起，我什么都不要。"

    # TODO 这里有问题，会阻止雨声
    # play sound fx.heartbeat
    "——"
    "宛如心脏被手拧住，强行收缩了一下。"

    voice "cv2/jiangwanqing/jiangwanqing_0136.ogg"
    jwq "只要想到你和别人在一起，我就忍不了。"

    "她完全没有了以往的游刃有余。"

    voice "cv2/jiangwanqing/jiangwanqing_0137.ogg"
    jwq "只要你还用看陌生人的眼光看着我，我就忍不了。"
    "到底是发生了什么，什么是契机，为什么……\n为什么你们总是要用那么悲伤的语气，说出我根本听不懂的话。"

    voice "cv2/jiangwanqing/jiangwanqing_0138.ogg"
    jwq "只要你和别的女孩子在我的眼前卿卿我我，我就忍不了。"
    "感觉身体的力气都被抽走了……"
    "被雨淋，就被雨淋吧，无所谓了。"

    voice "cv2/jiangwanqing/jiangwanqing_0139.ogg"
    jwq "一切都是我，都是我害的，但是……"

    cz "……"
    "雨幕化作屏障，\n紧紧贴合着的我们，心灵也好思绪也好，被通通隔开，就连声音也听不清楚了。"


    "我唯一知道的就是，眼前的少女，十分脆弱，脆弱到不抓住什么就会溺死，所以，她才抓住了我。"
    "小涟对我说过，不能伤害别人…而江晚晴，在最近这些日子的相处里，也不能说是别人了……"
    "她是我的恩人、我的老师、是我的朋友……"
    "我不能不管她。"

    cz "好了好了，虽然不知道发生了什么，但是，没关系。"

    "我把手放在了她的肩膀上，想要将我爱护的意念传达给她。"

    cz "如果有什么我能做的，就告诉我，我会想办法。"

    $ jwq.show("恐惧")
    voice "cv2/jiangwanqing/jiangwanqing_0140.ogg"
    jwq "没有办法。"
    voice "cv2/jiangwanqing/jiangwanqing_0141.ogg"
    jwq "不对，不对，有办法，但是，不能是我……"

    $ jwq.show("痛苦")
    voice "cv2/jiangwanqing/jiangwanqing_0142.ogg"
    jwq "可是，我明明……呜，明明，嘶……"

    cz "……"

    "我的安慰不但没有起到效用，反而让人家哭了。"
    "这是不是，我这辈子第一次弄哭除了曦曦以外的女孩子呢？"
    "抬头看向天。"
    "有水流进了我的嘴里，我吞了下去。"
    "凉凉的，就像她的身体一样。"
    "……"

    # === 第四幕：凉亭对话 ===
    # 【黑屏转场，雨声减小】
    stop sound fadeout 3.0
    scene black with dissolve
    pause 3.0

    scene bg neighborhood_vague
    show rainback scroll
    show pavilion
    play sound fx.light_rain loop volume 2
    "等她渐渐地冷静下来后，我还是把她拖到了边上的凉亭里。"

    cz "要不要去我家洗个澡？几十秒就能到，我这还有伞，虽然咱俩已经浑身都湿透了就是了……"

    $ jwq.show("落寞", pos=center)
    voice "cv2/jiangwanqing/jiangwanqing_0143.ogg"
    jwq "我……不想去。"

    cz "好吧。"
    
    "凉亭顶部瀑布般的雨点声，使得我连声音都听不真切，\n少女分明在我旁边，我却觉得她也好，她的声音也好，都很模糊……"


    cz "那你能放开我吗？"

    voice "cv2/jiangwanqing/jiangwanqing_0144.ogg"
    jwq "……"
    "抱得更紧了。"

    cz "……"
    "我的一只手臂被她揉到了怀中，用两只手抱着，挤压在她的胸上，抽也抽不出来。"
    "现在虽然不再是面对面拥抱的姿势，但是这样子被挽住，简直就像是小孩子怕跟丢了妈妈似的，让我实在有些尴尬。"

    cz "话说，你为啥要来我家小区，额……还在外面站着，盯着我家那边……我好像没告诉过你我住哪儿。"

    voice "cv2/jiangwanqing/jiangwanqing_0145.ogg"
    jwq "……曦曦。"

    cz "哦，原来是曦曦告诉你的？这家伙真是，唉算了，也没关系，只不过，你是想要？"

    $ jwq.show("痛苦")
    voice "cv2/jiangwanqing/jiangwanqing_0146.ogg"
    jwq "你和曦曦做了什么。"

    cz "啊？什么意思，和这有关系么。"
    cz "话说，这不都是你安排的嘛，现实Galgame。"

    voice "cv2/jiangwanqing/jiangwanqing_0147.ogg"
    jwq "你和曦曦，一起进你家了……对吧。\n你们……做了什么。"

    cz "……好像……什么也没做，嗯。"

    voice "cv2/jiangwanqing/jiangwanqing_0148.ogg"
    jwq "……"

    cz "到底是想问什么？这和你来我家楼下有关系么。"
    "似乎她说的，和我说的之间，有点驴唇不对马嘴。"

    voice "cv2/jiangwanqing/jiangwanqing_0149.ogg"
    jwq "我看到你们很开心的样子……"

    cz "如果是说开心的话，确实还算开心吧。"
    "这么说出来甚至有些嘲讽。"
    "今天一天，最后的心情与开心相差甚远，但大体上来说，在一整天的维度里，90%%的时间又是开心的。"
    "那到底是算开心，还是不开心呢？"

    voice "cv2/jiangwanqing/jiangwanqing_0150.ogg"
    jwq "我好嫉妒。"

    cz "嗯？"

    voice "cv2/jiangwanqing/jiangwanqing_0151.ogg"
    jwq "我好嫉妒曦曦。"

    cz "这……"

    voice "cv2/jiangwanqing/jiangwanqing_0152.ogg"
    jwq "我也想…和你约会……"

    cz "……"
    cz "……这本来就是既定事项吧？这样的话，要不就明天？如果不下雨的话。"
    cz "你自己安排的难道忘了，先是曦曦，然后是你。"

    "她听到我说的话，只是摇了摇头。"

    $ jwq.show("空洞")
    "然后，她抬起眼睛，望向我。"
    "那双眼睛很大，很漂亮，此刻却被一层水雾蒙着，睫毛湿漉漉地垂着，像是被雨水打湿的羽毛。那里面没有泪，或者说，泪似乎都沉到了很深很深的地方，只留下一种东西——纯粹的、沉重的悲伤，满得要溢出来。"
    "这一瞬间，呼吸不自觉地就屏住了，喉咙发紧，想说的话堵在嗓子眼，一个字也吐不出来。"

    voice "cv2/jiangwanqing/jiangwanqing_0153.ogg"
    jwq "没有我了。"
    voice "cv2/jiangwanqing/jiangwanqing_0154.ogg"
    jwq "我在这场戏里，只是一个……赠送的女主，没有踏上舞台的资格。"

    cz "……你为什么要这么说。"

    "她抱着我的力度又大了一分，仿佛是在害怕我逃走似的。"

    voice "cv2/jiangwanqing/jiangwanqing_0155.ogg"
    jwq "我已经，没有任何立场可以和你在一起了。"
    "但你现在，不正用行动表达着完全相反的意志吗？"

    voice "cv2/jiangwanqing/jiangwanqing_0156.ogg"
    jwq "就连现在，于情于理，我都不能呆在你这里……"

    cz "可是，你不是专门来研究我的吗？那个…就是，小涟……"

    voice "cv2/jiangwanqing/jiangwanqing_0157.ogg"
    jwq "嗯……"
    "少女只是嘟囔了一声，便没有再说话。"
    "借由雨点的切割，凉亭内仿佛自成了一个世界。"
    "对恩人的感谢、对老师的尊敬、对友人的关怀，各种繁杂的情绪显得那么轻飘飘，它们逐一消融在空间里，有如雪花落入了水中，连个涟漪都不见。"
    "而重新填满我身体的，是如同伤痕一般，能让人感到疼痛的空虚。"
    "江晚晴，很神奇地，我有点放不下她。"
    "为什么？是因为她是「天选之子」的候补人吗？是因为她是我的救命恩人吗？还是说她闯入我的生活，给我带来的新鲜感让我放不下她？"
    "总感觉…不是这样的。"

    cz "……想了解的话，我都告诉你吧。"
    cz "小涟的事。"
    "我从来没有告诉过任何人的……曦曦都不甚清楚的，只属于我一个人的世界。"
    "你不是想知道吗？"
    "像是要把自己的心灵给解剖开来一般，我对她敞开了心扉。"

    cz "小涟只是一个Galgame游戏角色，大概是在4、5年前，我就已经接触到了。"
    cz "那部游戏是个废萌呢，我很喜欢。"
    cz "……非常非常，喜欢。"

    "为什么呢？明明它左看右看，都是一个很普通的游戏。"
    cz "不知怎么的，我从那时起就有一个目标，让小涟被全世界知道。"
    cz "呵呵，很中二吧，和初中生真的很般配啊。"
    cz "但现在我也仍是这么想的。"
    cz "只是，和以前不同的是，现在的我，并不是把她当成一个游戏角色来看，而是把她当成一个真实存在的人……而且是我的，女朋友……这样子，来看待。"
    "虽然我自认为脸皮算厚的，但这样子对外人说出来，多少还是有点羞耻。"

    cz "要说有什么决定性的差异，我想，还是得说回三年前。"
    cz "刚说过了，最开始我只是想要让全世界知道小涟的存在，\n所以我的想法就是——天选试。"
    cz "只要在天选试走到最后一轮殿试，\n在那之前，就可以获得进入「天选台」祈愿的机会。"
    cz "从电视里看到的来说，这环节虽然只是走个过场，但上去的时候仍然是全程直播、全网关注的。"
    cz "我当时想的是我要穿一身小涟痛衣，在上去之前就当着所有人的面，直接把我要许的愿望说出来，我觉得那些记者们肯定要把它做成大新闻。"
    cz "……可惜天不遂人意，我明明准备了那么久，那么久……\n但是，甚至还没能参加就……"
    "能听到自己有点变形的声音。"
    "不甘，是的，现在仍然有不甘。"
    "深呼吸一口，还是挥去了这些杂念，我感受着手臂上终于温热了些的体温，继续说道。"

    cz "还没能参加天选试，在初试，也就是第一轮开始之前，我就出事了。\n你也知道的，毕竟你是第一发现人吧？"
    cz "说起来，你应该也是在那个时候去参加的天选试，这么一想，当时我被你发现也不奇怪了。"

    $ jwq.show("恐惧")
    voice "cv2/jiangwanqing/jiangwanqing_0158.ogg"
    jwq "噫……"

    cz "咦？"
    "这是什么反应？"
    cz "额，可能当时会有点血肉模糊？\n我也不是很清楚哈，我被卡车撞了……希望没给你留下心理阴影。"
    "好吧，底气实在是不足……"
    "想想就知道了，一个血人倒在地上，对当时只有14岁的少女而言，肯定不会是什么美妙的回忆。"

    cz "我只记得我躺在地上，看着头顶又大又圆的月亮……那之后，等到意识再次复苏时，已经过了两个月了，真是命大……"
    cz "然后，我就看到了，小涟。"
    cz "小涟就在我的病床边，一脸担忧地看着我，对我说着话。"
    cz "我知道的，毕竟医生都说了嘛……弥漫性轴索损伤。\n产生了虚构症啊，脚桥幻觉啊什么的，事后我自己也去网上搜了很多资料。"
    cz "但是我也没办法呀，确实没办法，毕竟——我已经爱上她了。"
    "自己的声音，听起来原来可以这么温柔的么……是了，就连这一份温柔，也是小涟给我的。"
    "在我的心里，小涟毫无疑问存在着。"
    "这样不就够了么？"
    "可是……"

    # （曦曦的幻影CG回想，加个滤镜）
    window hide
    $ quick_menu = False
    $ custom_ui = False
    show layer master at memory_filter
    show cg 005 with flash
    pause 0.5

    scene bg neighborhood_vague
    show layer master at reset_filter
    show rainback scroll
    show pavilion
    window auto
    $ quick_menu = True
    $ custom_ui = True
    $ jwq.show("恐惧")

    cz "……"
    cz "总之，要说是一见钟情好呢，还是颜控好呢……我醒来的那一瞬间，第一眼看到的就是她。"
    cz "反正，没有道理，没有原因，我看到她第一眼后，我就爱上她了。"

    voice "cv2/jiangwanqing/jiangwanqing_0159.ogg"
    jwq "不……"

    cz "不敢想象？可事实就是这样的，爱这种感情能有什么道理可讲，可能是类似于幼鸟的印刻现象之类，把出生后第一眼看到的移动物体当成母亲或依附对象。"
    cz "爱上她之后，那我的想法自然就变了，本来我就要参加天选试，让世人都知道小涟。然后呢，你看，天选试不是远古沟通神明的仪式嘛，我和小涟商讨过了，说不定那个叫做诺提拉的神……"

    $ jwq.act(anim_shake)
    voice "cv2/jiangwanqing/jiangwanqing_0160.ogg"
    jwq "不要……"

    cz "欸？"

    # （破防演出）
    $ jwq.show("痛苦")
    voice "cv2/jiangwanqing/jiangwanqing_0161.ogg"
    jwq "不要再说了！"

    "——！"

    voice "cv2/jiangwanqing/jiangwanqing_0162.ogg"
    jwq "小涟小涟小涟小涟，一直都是小涟！我不想，我不想再听到你说她了！"
    voice "cv2/jiangwanqing/jiangwanqing_0163.ogg"
    jwq "不要在我面前用这么幸福的表情说着别人的名字啊！"
    voice "cv2/jiangwanqing/jiangwanqing_0164.ogg"
    jwq "那样的话！那样的话……"
    voice "cv2/jiangwanqing/jiangwanqing_0165.ogg"
    jwq "那我呢……"
    voice "cv2/jiangwanqing/jiangwanqing_0166.ogg"
    jwq "你…爱着她的话，我怎么办……谁来爱我……"
    voice "cv2/jiangwanqing/jiangwanqing_0167.ogg"
    jwq "我怎么才能，被你注意到啊……"

    cz "……"
    "少女一句句说着，我手心发凉。"
    voice "cv2/jiangwanqing/jiangwanqing_0168.ogg"
    jwq "不要再对我说这么残酷的话了……"

    "我哑口无言，拥抱着我胳膊的那个少女，那个威严十足的江晚晴，此刻，宛如一个淋湿了身子瑟瑟发抖的流浪小犬，它瘸了腿，少了皮，于是只能发出令人心痛的呜咽声。"
    "我甚至通过我的手臂，感受到了少女心跳声消失的错觉。"

    $ jwq.reset_position()
    $ jwq.show("空洞2")

    "——她松开了我的手，难怪，心跳消失了。"
    "就像是我的心跳声，也随之而去。"

    voice "cv2/jiangwanqing/jiangwanqing_0169.ogg"
    jwq "……"

    $ jwq.hide()
    "江晚晴，她，转身向凉亭外跑去。"

    cz "喂！江晚晴！"
    "外面还在下雨呢！"

    scene bg neighborhood
    show rainback scroll 
    with dissolve

    play sound fx.rainstorm loop

    "少女的身子如此单薄，以至于让我有种她会被溺死在雨中的错觉，我顾不了那么多，跟着她的脚步冲了出去。"

    cz "江晚晴！"
    "我抓住了她。"

    $ jwq.show("空洞2", pos=center)
    show rainfront scroll
    voice "cv2/jiangwanqing/jiangwanqing_0170.ogg"
    jwq "放开我！"

    cz "不放！"
    cz "我不会让你就这么走掉的！"
    "否则——我绝对会后悔。"
    "冥冥中的预感，从我内核升腾而出。"
    "我从未有过如此强烈的直觉，在思考之前，身体就已经擅自动起来了。"

    voice "cv2/jiangwanqing/jiangwanqing_0171.ogg"
    jwq "……求求你，不要再让我显得更凄惨了。"
    "她背对着我，用力挣脱了两下，力气比我想象的要更大些，但终究没能挣脱开。"

    cz "江晚晴，你在思考什么，你在想什么？你要告诉我什么？我应该怎么做？我想……我是想要，想要去帮助你的！"
    "掏空脑汁，也找不到任何能支撑她的话语，我只能把自己单纯的、最纯粹的本心释放出来。"

    "……"
    stop music fadeout 2.0
    "…………"
    "江晚晴听到我说的话，渐渐地，她消停了，手也不再尝试挣脱，只是安静地站在那里。"
    "怕弄疼了她，于是我放开了手。"
    "——然而，等待着我的，却并不是想象中的任何一种回应。"

    play music "audio/bgm/BGM_痛苦落泪.ogg" loop fadein 1.0
    scene cg 006 with Dissolve(2.0)
    $ renpy.pause(2.0, hard=True)

    voice "cv2/jiangwanqing/jiangwanqing_0172.ogg"
    jwq "呵，呵呵呵……江…晚晴么。"
    "她终于回过头来，将视线对准了我，这一瞬，时间被粘稠的雨滴拖慢、拖长。"
    "少女的眼睛失去了焦点，只剩下无边无际的悲伤和茫然。"

    voice "cv2/jiangwanqing/jiangwanqing_0173.ogg"
    jwq "为什么，不叫我晚晴？"
    "对方的声音倾泻过来，毫无保留。"
    "我被她震慑住了，被她如刻刀一般的情感震慑住，心底处，有一道清晰而锐利的印记渗出了血来。"

    voice "cv2/jiangwanqing/jiangwanqing_0174.ogg"
    jwq "今天……你和曦曦玩得很开心吧。\n你……有想到我一下吗？"
    voice "cv2/jiangwanqing/jiangwanqing_0175.ogg"
    jwq "约会、牵手、拥抱……\n还做了什么？还有更多吗？"
    "不知怎么的，和她的眼睛对视着，我感到一丝惭愧。"
    "我甚至无法控制自己，低下了头，不敢去看她。"

    voice "cv2/jiangwanqing/jiangwanqing_0176.ogg"
    jwq "可是，我根本就没有权利去说她……\n我能待在你的身边，已经是她宽容的结果了……"
    "雨水在她脸上纵横流淌，冲刷着睫毛、鼻梁、嘴唇，汇成一道道冰冷的水痕，勾勒出她此刻毫无生气的轮廓。"
    "仿佛连灵魂都已被连根拔起，残留下的，是一个徒具形骸的空壳，在雨中飘零。"

    voice "cv2/jiangwanqing/jiangwanqing_0177.ogg"
    jwq "我知道的啊，我知道的，她一直都是个好孩子，很早以前就知道了，曦曦是我重要的…朋友，她也是，最喜欢你了……"
    voice "cv2/jiangwanqing/jiangwanqing_0178.ogg"
    jwq "她是一个宁愿自己受伤，也不愿看到其他人受伤的，天使一样的人。"
    voice "cv2/jiangwanqing/jiangwanqing_0179.ogg"
    jwq "但是，就算是这样，看到她和你在一起，我还是会……有一种心脏被撕裂的感觉。"
    "为什么？"

    voice "cv2/jiangwanqing/jiangwanqing_0180.ogg"
    jwq "你连这个也意识不到。"
    voice "cv2/jiangwanqing/jiangwanqing_0181.ogg"
    jwq "这些，明明都是我的……"

    "这些，是哪些？"
    "她的双臂无力地垂在身侧，手指微微蜷曲着，指尖泛着失温的惨白，仿佛想抓住什么，结果却只是徒劳地拢住一点早已消散的暖意。"

    # （隐忍抽泣）
    voice "cv2/jiangwanqing/jiangwanqing_0182.ogg"
    jwq "我又能怎么样呢？我在梦里，在梦里幻想过无数次，如果我当时……如果你没有出车祸就好了，如果一切如往常……就好了，天选试我也不参加了，小涟什么的，也无所谓了……只要你没事就好。"
    voice "cv2/jiangwanqing/jiangwanqing_0183.ogg"
    jwq "明明请了最专业的医生来看你，他们却说看天意……那不是谁都没办法了吗……我只能做梦了啊，我只能在心底幻想，我只能向神明祈求，我什么都做过了。"
    voice "cv2/jiangwanqing/jiangwanqing_0184.ogg"
    jwq "什么都做过了。"
    voice "cv2/jiangwanqing/jiangwanqing_0185.ogg"
    jwq "包括这一次，可能是我最后的尝试……"
    voice "cv2/jiangwanqing/jiangwanqing_0186.ogg"
    jwq "我已经做好觉悟了，真的，别看我这样……现在，好像显得，很凄惨的样子……其实我是一个，很坚强的女人哦。"
    voice "cv2/jiangwanqing/jiangwanqing_0187.ogg"
    jwq "身份也好，爱也好……我是一个，可以把什么都放弃掉的，很坚强的女人哦……"
    voice "cv2/jiangwanqing/jiangwanqing_0188.ogg"
    jwq "明明是这样的。"
    voice "cv2/jiangwanqing/jiangwanqing_0189.ogg"
    jwq "毕竟，本来就是我的问题……一切都是我导致的……我有这个自觉的啊，肯定有的……我已经，失去所有的特权了，光是你能活着，我就别无所求了。"
    voice "cv2/jiangwanqing/jiangwanqing_0190.ogg"
    jwq "所以，如果，如果是曦曦的话……我也…甘愿退场……"
    voice "cv2/jiangwanqing/jiangwanqing_0191.ogg"
    jwq "只要是曦曦的话，只要你愿意的话，就行了……"

    "为什么？"

    voice "cv2/jiangwanqing/jiangwanqing_0192.ogg"
    jwq "我已经有在用力地克制自己了，哪怕忍不住，我也在克制自己……"
    voice "cv2/jiangwanqing/jiangwanqing_0193.ogg"
    jwq "可是小涟…我不想，我不想听到你说你喜欢她……"
    voice "cv2/jiangwanqing/jiangwanqing_0194.ogg"
    jwq "我不想，看到你谈论小涟时，满脸幸福的样子……"
    voice "cv2/jiangwanqing/jiangwanqing_0195.ogg"
    jwq "女友为什么会是小涟呢？不应该是这样的……"

    "她的声音仿佛要哭出来。"
    "或许，现在其实已经在哭泣了也说不定。"
    "我们彼此沉默了一会。"
    "只留下这片雨幕，作为背景的噪音。"
    "她的眼神，让我低下了头。"

    voice "cv2/jiangwanqing/jiangwanqing_0196.ogg"
    jwq "阿舟，求你了。"
    voice "cv2/jiangwanqing/jiangwanqing_0197.ogg"
    jwq "放弃小涟吧。"
    voice "cv2/jiangwanqing/jiangwanqing_0198.ogg"
    jwq "否则的话，对我来说，也太残酷了……"

    "不知道是雨水还是泪水的水珠，缠绕在睫毛上，让浮现在眼前的少女变得模糊不清。"

    cz "……晚晴。"
    "我只是想这么叫上一声。"

    voice "cv2/jiangwanqing/jiangwanqing_0199.ogg"
    jwq "……"
    "我看到，少女的脸庞扭曲了一下……"
    "只这一下，我便浑身软了下来，我想……是我太后知后觉了。"
    "或者说，是我没有去看……只注视着自己……"
    "但就算如此，我也不能在这里退缩，所以，我还是咬着嘴唇，对她说道。"

    cz "我和你之间，到底……"
    "——"

    "我话还没有说完。"
    "她，转身离去。"
    "没有回话。"
    "最后那一眼里的哀伤，让我定在原地，手也抬不起来。"
    "雨一直下。"
    "我站着，像是被丢在空荡荡的世界里。"

    # === 第六幕：深夜的泪 ===
    # 【卧室（夜）】
    stop music fadeout 2.0
    stop sound fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)

    scene bg room1_4 with dissolve
    play sound fx.light_rain loop
    play music "audio/bgm/BGM_轻柔孤独哀伤.ogg" loop
    "……"
    "躺在卧室的床上，思绪像螺旋般缓缓转动，又渐渐收紧。"
    "短短一天之内经历的情绪起伏，或许比过去三五个月还要剧烈。"
    "和曦曦又更加亲近了……对江晚晴的理解也更深了一点……"
    "一切都在切实地推进着，却又似是而非，同我所想的结局完全不同。"
    "或许我选错了什么选项，在个人线里，触发了失败flag。"
    "究竟怎么了？是我做错了什么吗？"
    "我本是怀着善意，想去帮助人、温暖人的。"
    "可伸出的手，却在不知不觉间化作刀刃，触碰的同时，也划出血来。"

    cz "现实Galgame，我想玩的，可是废萌啊。"
    "毕竟我是废萌党。"
    cz "哪有废萌，进了个人线后，还能打出坏结局的……\nGalgame里不是这么说的啊……"

    "说起来，江晚晴说过，要让我不要局限在废萌里，这也是她的用意吗？\n她预料到了吗？是不是我想太多了……"
    "我就这样，和不知道在哪里的人对话着，于是心灵也好，头脑也好，纷纷不受我控制的冷静了下来。"
    "头脑里的螺旋，转动速度慢了很多。"
    "是啊，毕竟是螺旋，总会有个中心点的什么的吧？可是…我明明克制着自己，不要去思考那个中心点了。"
    "怎么回事呢，将各种碎片拾起来后，将今天一整天发生的事情，全部归纳后，头脑里的思绪，自然而然就被整理好了。"
    "于是，我轻声说出了位于那个中心点的名字。"

    cz "小涟……"

    "似乎，鼻子有点酸了。"
    cz "小涟，小涟，小涟……"

    "突然有种想哭的感觉。"
    "我是男孩子，我当然清楚，男孩子是不能哭的，这道理从懂事起就明白。\n或许生来是会的吧，比如小时候，如果不能哭出来的话，那刚诞生于这个世界就要被憋死了……"
    "但是，但是啊，随着长大，就连母亲都会把你的眼泪擦掉，轻声说别哭了，于是整个世界将你吞没，家庭、学校、社会，没有一个可以流下泪水的地方。"
    "——我流下了泪水。"
    "可以体会到，一点水渍从脸颊划过的湿润感。"
    "我为什么会这么地喜欢小涟呢？或许正是因为，我可以在她面前，毫无保留地，把自己的心灵打开吧。"

    "我坐了起来，看向小涟。"
    $ xl.reset_position()
    $ xl.show("温柔", pos=center)
    "她就在我的旁边，不知不觉的时候，就坐到了我的身边。"

    cz "……小涟。"
    voice "cv2/xiaolian/xiaolian_0041.ogg"
    xl "嗯，我是小涟，你的小涟。"

    cz "小涟……你是存在的吗？还是说，只是我的幻想呢？我真的需要，靠近现实一点吗？"
    "她上次可是说，她是好好存在着。"

    voice "cv2/xiaolian/xiaolian_0042.ogg"
    xl "唔唔唔……可能需要你来决定呢……你想要听到什么样的回答呢？你想听到的，是我的回答，还是你心里的回答？"
    "别看小涟总是一副呆呆萌萌的模样，但她每一次，都是在安慰我的时候好好安慰我，在我认真思考的时候，鼓励引导我。"
    "这就是我们之间，无与伦比的感情。"

    cz "我真的搞不懂啊，能看到的，能摸到的，能感受到的，若通通不是现实，那现实不现实的，又有什么意义呢？"
    cz "再说了，爱不爱什么的，和现不现实，有什么关系？靠近现实也好，不靠近现实也好，到底有什么区别，我自己也搞不懂，到底是哪里出问题了。"
    cz "而且啊，而且啊，当一个人说出，爱谁的时候，他真的能理解，自己在说什么吗？除了外科医生，没有人可以进入他人的体内吧？除了超能力者，没有人能够知道他人心灵所想吧？"
    cz "所以说，那些电视剧里的，那些婚礼上的，他们难道不是，只是在单单的靠着相信，在爱吗？在做出爱的决定吗？"
    cz "你相信我，我相信你，只需要这样，两个人就能构建出一个，名为「爱」的世界，很简单啊？不就是这样吗？一切都是信与不信的问题吧？我也是这样做的啊？"

    "连珠炮似的，我向小涟倾泻了我胸中的黑泥，而她全部默默接受，只是用一副「没事的，多多依赖我吧」的表情包容我。"
    "光是这样，就让我的胸中满是怜惜。"

    cz "所以说啊……"
    cz "所以说啊，所以说啊……"
    "我甚至有点语无伦次了。"
    cz "所以说，我和别人之间，到底有什么区别？"
    "还是说，区别不在我的身上？"

    "——我悚然一惊，脑海中，浮现了两个少女的面孔。"
    "而听到我的话，小涟却不急不躁，只是可爱的捏着衣服，揉着转着自己垂落的头发，我真的，真的，非常非常尊敬她这一点。"
    "明明是一个小小的身体，却有着无限大的心，她的博爱与宽容，再度覆盖了我。"

    voice "cv2/xiaolian/xiaolian_0043.ogg"
    xl "有这样一个说法哦，人们爱的是一个「完美偶像」，被爱之人只是想象中优点所层层叠加的投影，王子斩杀恶龙，迎娶公主，故事一般到这里就结束了，你知道为什么吗。"
    voice "cv2/xiaolian/xiaolian_0044.ogg"
    xl "因为日积月累，相处久了之后，一切都会暴露出来，王子也好，公主也好，冒险过后，就要面对鸡毛蒜皮了，到那时再说什么爱不爱的，就没意义了，因为已经褪色了。"

    cz "好残酷的说法，不太喜欢啊。"

    "小涟靠近了我，她的目光中含着水润的色泽。"

    $ xl.hide()
    $ xl_l.show("害羞")
    voice "cv2/xiaolian/xiaolian_0045.ogg"
    xl "但是我不用吃饭哦？而且也不会老，所以，和我在一起的话，是不会有任何鸡毛蒜皮的，嗯，或许，我们之间的爱，才是真正的爱也说不定。"
    voice "cv2/xiaolian/xiaolian_0046.ogg"
    xl "海枯石烂，地久天长……无可置疑的，我们之间的感情……"

    "她抱了过来，怀中的柔软，让我感到了战栗。"
    "安宁，就像是被棉花糖包裹着，就像是回到了羊水里，回到了冬日暖和的棉被中。"

    cz "啊，小涟…小涟……小涟……"
    voice "cv2/xiaolian/xiaolian_0047.ogg"
    xl "嗯……"
    cz "小涟……小涟……"

    "我狠狠地抱住她，用了很大的力气，力气大到，甚至让怀中的小涟感受到了痛苦。"
    "但我还是，克制不住。"
    "我的鼻孔，在疯狂地吸入她发丝间的香气；\n我的手臂，在大力地箍住她的腰肢；\n我的双腿，生怕她离开而狠狠地抵住了她的腿臀。"
    "我是如此的，渴求着小涟，就是鱼在渴求着水，天经地义，理所当然。"
    "因为我就在床上坐着，所以，我甚至要动用无边的意志力，才能克制住自己，免得一不小心反手把怀中的可人带到枕头边。"
    "——她简直就是，我理想中最完美存在的化身。"

    voice "cv2/xiaolian/xiaolian_0048.ogg"
    xl "我肯定是最适合你的完美伴侣哦？肯定的。"
    "她在我的耳边喃喃低语。"
    "是呀，没错，一点错也没有，我心知肚明，小涟也心知肚明。"
    "毕竟……我们早就对彼此，充满了相信了。"
    "而且，我早就……做好了觉悟的……"

    
    $ xl_l.hide()
    $ xl.show("卖萌叹气")
    voice "cv2/xiaolian/xiaolian_0049.ogg"
    xl "不过，喜欢你是喜欢你没错啦。"

    cz "哎？"

    voice "cv2/xiaolian/xiaolian_0050.ogg"
    xl "陪你一生一世，甚至到下辈子、下一百辈子的准备，我都做好了也没错啦……"

    $ xl.show("温柔")
    voice "cv2/xiaolian/xiaolian_0051.ogg"
    xl "但是作为妻子，看到丈夫是一个这么没有觉悟的人，还是会觉得，有一点点伤心的，一点点哦？不影响我对你的喜欢的。"

    cz "是，是这样吗？我没有觉悟吗？"
    cz "可是我明明什么觉悟都有啊，天选试也好，每日的苦功也好，被别人不理解也好……"

    "我没有觉悟吗？"
    "到底是少了，哪个部分的觉悟？"

    voice "cv2/xiaolian/xiaolian_0052.ogg"
    xl "你要成为Galgame领域大神吧？那这就是你最擅长的了。"

    "我最擅长的、Galgame里的。"
    "Galgame里的……"
    "……"
    cz "选择…吗……"
    "选择。"
    "自己的声音，有着干涩的味道。"
    "两个字，是具备千钧重量的词语。"
    "如果说，现在的我，正在玩着一部现实Galgame，那么，小涟不就是真女主吗。"
    "不管怎么样，最后都会走到小涟线的吧……"
    "我陷入了沉思。"
    "说起来，我可是一个废萌党。"
    $ xl.show("温柔")
    "那么……"

    # 分支选择
    menu:
        "废萌有白毛真女主是祖宗章法":
            "我其实是一个传统的人啊，前辈们不是已经有案例了吗？比如那一部讲述魔女的……"
            "所以说，废萌里，有真女主，或许并不奇怪。"
            "可是……"
            "……"
        "废萌不该有真女主哪怕是白毛":
            $ true_end_flag += 1
            "如果废萌有一个钦定的真女主，那样的话，对于其他的女主来说，不是很不公平吗？"
            "我认为……废萌……是博爱的。"
            "所有女主，都应该是平等的才对。"
            "……"

    $ xl.hide()
    "今天，是我最近一年来，唯一没有努力用功的日子。"
    "天选试，我还是得参加。"
    "是否可以在那里，寻找到属于我的答案呢……"
    "我抱着小涟，什么都没做，只是感受着她的温暖，体会着安心。"
    "然后，度过了这个，难以称得上安心的夜晚。"

    $ achievement.grant("ACH_03")
    $ achievement.sync()
    stop music fadeout 2.0
    stop sound fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ lx.reset_position()
    $ jwq.reset_position()
    $ xl.reset_position()
    return