# ----------------------------------------------------------------      
# 剧本：河边（白天） 
# ----------------------------------------------------------------

label scene_3_2:

    show black
    with dissolve
    $ script_box_alpha = 0.0
    centered "{size=40}几天过去，周末如期而至。{/size}"
    $ script_box_alpha = 1.0
    $ renpy.pause(3.0)

    scene bg riverside_road2 with dissolve
    
    # 播放初始 BGM
    play music "audio/bgm/BGM_治愈.ogg" loop fadein 1.0

    "时间……应该就快到了。"
    "今天一天，我在外面走了很久。"
    "主要是思考。"
    "感觉心情整理得差不多后，我来到了这里。"
    "环境变得空旷，风声也拖着尾音。"
    "似是有什么东西自世界背面翻转了过来。"
    "可阳光依旧，河水缓行，一切事物均忠实随着既定的程序运转。"
    "橘色的光自天际漫来，将世界染成一副温暖模样，堤防路边的榉树上，繁密的叶片捕捉着光线，于我眼中形成一副金绿交织的流景。"
    "混凝土路的坚硬触感稳稳托举着我，我行走着，向前看，看不到尽头。"
    "我忽然想起一个传说：古时天门山有一秀才人家，秀才屡试屡挫，妻子恐其沉沦，与其约赌，与其约定，在家门口石头上种榉树，有心者事竞成。"
    "后来，榉树竟与石头长在一起，秀才也终得中举归来。"
    "因“硬石种榉”与“应试中举”谐音，我望着河中那个将诸多榉树化为背景的男子，仿佛看见了某种尚未抵达的未来。"
    "天选试的日子，就要到了。"
    "在那之前……还有需要解决的事。"
    "穿透河面，我发现自己反复看向同一个位置——"
    "总觉得那边有什么东西，正在走向我，只是还没决定好现身的方式。"
    "我不知道接下来会发生什么。"
    "只是心领神会——"
    "今天，已经无法像往常一样结束了。"

    # 林曦出场
    $ lx.show("开心", pos=right, x_offset=-250)
    voice "cv3/linxi/linxi_0029.ogg"
    lx "Ciallo~早呀早呀。"
    cz "嘿嘿，行吧，虽然是下午，但还是说声早~"

    "我们相视一笑。"
    "提早到来的我，遇见了提早到来的她。"
    "她从那边过来，印证了我的预感。"

    $ lx.show("微笑")
    voice "cv3/linxi/linxi_0030.ogg"
    lx "喜欢提前20分钟到预定的地方，是你的坏毛病啊，每次为了配合你我也要早来。"

    cz "……那样我提早还有什么意义，本来就是为了做等待的那个人而提前的。"

    $ lx.show("害羞", pos=center, x_offset=0)
    "她轻快地小跑到我身边，随我一同吹着河风，并肩走着。"

    voice "cv3/linxi/linxi_0031.ogg"
    lx "比起被等，我还是更喜欢恰到好处的遇见，只要这样，我就会在心底偷偷觉得，好像在某些地方赢了。"

    cz "赢？赢什么。"

    voice "cv3/linxi/linxi_0032.ogg"
    lx "晚晴啊……"

    cz "关她什么事……"
    cz "话说你们是不是组成什么女子联盟了，专门用来讨论我。"

    "不怪我多想，就是有这种感觉。"

    $ lx.show("叹气")
    voice "cv3/linxi/linxi_0033.ogg"
    lx "哎~反正，一切都要在今天结束了吧。"

    cz "……"
    cz "……结束么，有点害怕啊。"

    $ lx.show("平静")
    voice "cv3/linxi/linxi_0034.ogg"
    lx "没什么好害怕的，反正，总有一天我也会忍不住吧。"
    voice "cv3/linxi/linxi_0035.ogg"
    lx "我是真的好想，好想赢一次她啊。"
    voice "cv3/linxi/linxi_0036.ogg"
    lx "总感觉从以前到现在，从来没有一次，没有一次是真正赢了她的……"

    cz "是么，虽然我不太懂，不过，我还是祝你能得偿所愿。"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0037.ogg"
    lx "嗯嗯…你还记得吗，我和你约会的那一天。"

    cz "当然…记得。"
    "一周前的那一天，现实Galgame，我，不可能忘记。"

    $ lx.show("开心")
    voice "cv3/linxi/linxi_0038.ogg"
    lx "我其实…一直是有一点，一点点哦，有一点点自卑的。\n但是，那一天真的好开心，在包厢里的那个时候，就像幻觉一样，总感觉，自己多少也有点机会了。"
    voice "cv3/linxi/linxi_0039.ogg"
    lx "嘿嘿，希望不是幻觉呢。"

    $ lx.show("开心", pos=center, x_offset=0, zoom=2, transition=dissolve,  y_offset=1900)
    "她悄悄地平移过来，往我身上靠了一下，很快又分开了。"

    $ lx.reset_position()
    $ lx.show("开心")
    "同一时间，我的口腔中弥漫出了格外浓郁的甜香味。"

    cz "哈哈……"

    "我只能干笑了一声，没有回答，或许是因为，我不知道该怎么回答。"

    $ lx.show("平静")
    voice "cv3/linxi/linxi_0040.ogg"
    lx "如果要赢…就要堂堂正正才行。"

    cz "堂堂、正正么。"

    $ lx.show("害羞")
    voice "cv3/linxi/linxi_0041.ogg"
    lx "是的。"
    voice "cv3/linxi/linxi_0042.ogg"
    lx "所以今天，我的心情，我想让你全部知道，同时……让她见证。"
    voice "cv3/linxi/linxi_0043.ogg"
    lx "这些年来，我对你……"

    cz "……"

    "少女的决意自双瞳中逸散而出，却并不显得炙热，而是带有一种温暖的包裹感。"
    "自榉树枝叶穿过的碎光打在少女脸上，复又反射进我的眼中，让人觉得，颇为耀眼。"
    "我猜到了，就是那样吧……"
    "曦曦…是要对我说……"

    $ lx.show("微笑", pos=left, x_offset=250)
    $ lx.act(anim_jump)
    voice "cv3/linxi/linxi_0044.ogg"
    lx "啊！江晚晴！"

    # 江晚晴出场
    $ jwq.show("平静", pos=right, x_offset=-250)

    voice "cv3/jiangwanqing/jiangwanqing_0023.ogg"
    jwq "……下午好。"

    "河提边的树荫下，站着一位卓有风姿的少女，她浑身上下透露出一阵出尘气息，相比起之前，像是褪下了外壳，只有会随风飘散的灵魂被留了下来。"

    cz "哟，下午好，你也来了。"

    $ jwq.show("微笑")
    voice "cv3/jiangwanqing/jiangwanqing_0024.ogg"
    jwq "嗯，既然被邀请了，那就不得不来了。"

    "一阵风儿吹过，眼前少女的黑色头发，像是追逐风一般随之流动，她轻轻捂着，眉角微抬，用一对如星般的瞳孔看向我。"

    cz "总之先散散步吧，趁着太阳还没下山，现在这个温度，挺舒服的。"

    "没有多余的话，我对她点了点头。"
    "然后带领着她们二人，沿着河道走去。"

    # TODO 搞一张影子CG
    $ jwq.hide()
    $ lx.hide()

    "江晚晴在左边，曦曦在右边，三个人肩并着肩走在一起，用不知是否轻快的脚步行进起来。"
    "她们的气息在我身边脉动，今天也好明天也好，此时此刻，我都没有去想的欲望了，取而代之的是，细细品味着的、在胸腔中回转着的、此时此刻之体验。"
    "——我很喜欢这种，和他人一起默默行走的氛围。"
    "人与人并肩，却无需言语，只有规律的脚步声交错，呼吸同频，寂静都变得温暖。"
    "这让我认知到，哪怕我是一个比较奇怪的人，也能生存在这个世界上，不论怎样，依然有着愿意与我同行的存在。"
    "这个世界很大，大到什么奇奇怪怪的人都能生存。"
    "喜欢Galgame的人，不喜欢Galgame的人，和女鬼谈恋爱的人，和虚拟角色谈恋爱的人……在彼此眼中，谁又不是怪人？"
    "我或许就是那万千怪人中的其中一个。"
    "怪人的世界，注定是无法被彻底理解的吧。"
    "科学家可以参照三维理解四维，参照二维的纸在三维的变形去理解三维的空间扭曲。"
    "这还都好，因为毕竟他们可以认识到有自己理解不了的事物，而去尝试着理解。"
    "但是对于那些他们根本不可能认识到的，更不要说尝试着理解的事物呢？"
    "我们只能理解得了自己能理解的事物，这是理所当然的。"
    "就如同其他动物只能理解和它大脑相匹配的事物一样，其他动物是理解不了科学的，理解力的边界，早被基因与经验悄然锁死。"
    "传说中，人类曾试图建造一座通天之塔。"
    "他们说着同一种语言，怀着同一种野心，以为只要高度足够，就能触碰神明的领域。"
    "可结果却是，语言被打碎，意义被拆散。"
    "从那一天起，人不再真正理解彼此。"
    "即便面对面交谈，也不过是在各自的世界里，自说自话。"
    "巴别塔倒塌的，不只是砖石。"
    "而是人类对完全互通的幻想。"
    "不管是谁，想要认知到另一个人的世界是什么样子，终归还是……无法做到。"
    "有的家伙主观而充满创造力，觉得人世充满可能，所以他们会去尽可能地体验这个世界，尝试各种让自己快乐的、激发自己感性的劳动，在生活与社会中感受自己的存在。"
    "而有的家伙会觉得世界处处设限，有道德，有伦理，有承担，更有责任，走到哪里，属于他的一方世界就框定在哪里，他们现实主义，他们品尝着禁锢，戴着镣铐，挣扎跳舞。"
    "谁又能断定，你是怪人，还是他是怪人。"
    "如果说，有人愿意选择一条坚定的路走下去，哪怕本质上是自欺欺人，可做出这个选择的行为本身，不是仍然具备着生命力吗？"
    "我是想要，去相信的——"
    "与其说是在依靠理性，还不如说是依靠荒谬，但正因如此，才想要去相信。"
    "正是因为荒谬，所以才选择了相信。"
    "……"
    "早在好几年前，就已经选择过了，不是么。"
    "说起来，很久前我有看到过，一个男人和虚拟歌姬举行了婚礼。"
    "有人嘲笑，有人讽刺，当然，也有人支持，我……大概是支持的那边吧。"
    "那样的生存姿态，在我眼里，也别有一番浪漫。"
    "我知道的，晚晴，还有曦曦，她们的想法虽然看不清楚，但导向的目的，我再清楚不过。"
    "她们想让我……抛弃小涟。"
    "可在我看来，这和「杀死」小涟，是同样的描述。"

    cz "（呵呵……还真不想做啊……）"

    "这与对、错无关，只是一个信徒，抱着炙热的信念，一往无前。"
    "在祭坛上，为此焚尽一切……"
    "{space=200} ——倘若真能做到的话。"
    "而「倘若」二字，便是所有决心的裂隙。"
    "身边两侧，所传来的脉动，居然是如此地温暖。"
    "我真的好想，真的真的好想，一直这样走下去。"

    voice "cv3/jiangwanqing/jiangwanqing_0025.ogg"
    jwq "这个地方我很少来过，是你们的回忆之处吧，\n如果能一直走下去……感觉也不错。"

    cz "嗯，是啊，我也觉得。"

    "江晚晴说出了与我所想同样的言语。"
    "……我无法焚尽的，是这些沉默同行者的温度。"
    "为了保持与我并肩的节奏，她们小心翼翼，自然迁就。"
    "这让我心里那点孤零零的、悲壮的火，显得虚幻。"
    "她们进入了我的世界么？\n她们理解了我么？"
    "不管有没有，那些都是无所谓的了。"
    "尤其是……曦曦。"

    voice "cv3/linxi/linxi_0045.ogg"
    lx "唔，可能还需要走一点距离哦。"

    "我看向她的脸，她对我露出一个浅浅的笑容。"
    "眼睛中映射出了我的相貌，浅浅的阳光下，恍惚间就像是见到了春日滟滟之湖水。"
    "过去的那几年，她是不是悬置了自己的所有判断，悬置了以往的舒适相处，甚至悬置了一部分真实自我……才为我腾出一块空间，陪着我，踉跄行走呢。"
    "这或许也并非理解吧，但我认为，这是远超理解的、更为珍贵的东西。"
    "我忽地回想起一周前，那一天。"
    "两个女孩子，在我面前留下眼泪的那天。"
    "宛如雨滴把不曾交汇的天空和大地连接起来那样，她们的泪水，也把我的心，同她们串联了起来。"
    "我或许，在自己都没意识到的情况下，就已经持续着、缓慢着伤害到了她们吧。"
    "终于终于，有了这个自觉。"
    "低头审视自己的影子……悠悠，长长。"
    "那里边藏着，属于她们二人的轮廓。"

    $ lx.reset_position()
    $ lx.show("微笑")
    voice "cv3/linxi/linxi_0046.ogg"
    lx "舟子，你还记得吗，就在这个地方，我们小时候打过一架。"

    cz "额，记倒是记得，怎么提到这个了，怪尴尬的。"

    "尴尬的原因是，我没打过她……"

    $ lx.show("叹气")
    voice "cv3/linxi/linxi_0047.ogg"
    lx "年纪小就是好啊，当时我的力气比你大多了，可惜时光一去不复返。"
    voice "cv3/linxi/linxi_0048.ogg"
    lx "现在想想，就是从那个时候起，我就放不下你了。"

    cz "是这样吗？"

    "我倒是没什么自觉，小孩子的打架，记仇能记过一星期就不错了。"
    "只要过了几天，看着人家和别的孩子一起玩，自己也想玩的话，屁颠屁颠就凑过去了，之后就是再次厮混到一起。"
    $ lx.show("微笑")
    voice "cv3/linxi/linxi_0049.ogg"
    lx "大概是因为成熟得更早吧，我小时候一直觉得身边的男孩子很幼稚，包括你。"

    cz "……好像无法否认，是这么一回事。"

    "自己小时候有多熊，除了自己以外，最熟悉的估计就是曦曦了。"

    $ lx.show("平静")
    voice "cv3/linxi/linxi_0050.ogg"
    lx "我是这一片的老大，接触的熊孩子挺多的，因为各种原因和别的人发生矛盾的次数也很多，但其中，印象最深的，果然还是你。"
    voice "cv3/linxi/linxi_0051.ogg"
    lx "……我们的，孽缘的，起点，哎。"

    cz "可是我们在那之前，已经在一起玩了好几个月了吧。"

    $ lx.show("微笑")
    voice "cv3/linxi/linxi_0052.ogg"
    lx "是啊，可对我来说，那几个月和别的玩伴没什么不同。\n直到打完那架……你一言不发的跟在我后面，跟了整整三天呢。"

    cz "欸？有这么久？我只记得那天下午了。"

    "不会是你编的吧？"
    "算了，看到这没有防备的表情，就算是编的我也认了。"
    "更单纯的……可能只是，我没把那段回忆当成什么值得纪念的事吧……"

    $ lx.show("微笑")
    voice "cv3/linxi/linxi_0053.ogg"
    lx "你离我大概十步远，我快你也快，我慢你也慢。我蹲在河边看蚂蚁搬家，你就站在后面的槐树下抠树皮。"
    voice "cv3/linxi/linxi_0054.ogg"
    lx "第三天傍晚，我实在忍不住了，就对你喊“你到底要跟到什么时候~”这样，我还记得你被吓了一跳。"

    "阳光把她的侧脸染得明媚，睫毛垂下的阴影轻轻颤着。"
    "我忽然有些恍惚，那个站在槐树下、手指沾满绿色树皮屑的男孩，真的是我吗？"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0055.ogg"
    lx "从那时候起，我就对你感到好奇了，然后，放不下你了……"

    "居然，这么普通么……"
    "我还以为是多么惊心动魄的故事。"
    "要是放在Galgame里，这么平凡的事……嘿，是废萌呢。"
    "我最喜欢废萌了。"

    cz "原来还有，这么一回事。"

    "能听得见，我嘴里说出来的话语，带着笑。"

    $ lx.hide()
    show cg 007 with Dissolve(3.0)
    
    "她终于停下脚步，转过来看我，眼睛里有种我从未见过的、清亮而柔软的东西。"
    
    "江晚晴默默地退到一边，只把舞台留给了她。"

    voice "cv3/linxi/linxi_0056.ogg"
    lx "在之后，不知不觉间，就习惯了呀，习惯和你走在一起。习惯留心你在哪里。"
    voice "cv3/linxi/linxi_0057.ogg"
    lx "喂，陈舟。"

    "我的心脏扑通一下。\n感受到了什么。"

    voice "cv3/jiangwanqing/jiangwanqing_0026.ogg"
    jwq "……"

    "我到现在，还有一丝余裕去看周围，我看到晚晴抱着双臂，看到她的脸上，瞬间浮现又很快隐藏起来的挣扎。"
    "而后，转眼间，就被曦曦的言语吞没。"

    voice "cv3/linxi/linxi_0058.ogg"
    lx "你把我，当成是你的好哥们么？"

    "话出口的瞬间，我明白了她的意思。心跳忽然变得清晰而平稳，像终于找到了正确的节拍。"

    cz "放在不久前，或许还是的吧。"

    show cg 008 with dissolve
    voice "cv3/linxi/linxi_0059.ogg"
    lx "嗯。"

    "她只是笑了笑。"

    cz "经过最近一阵子的事情，我也不清楚了。"

    "在当下的场景，我必须展现诚实。"

    cz "但应该……不太能把你当哥们了吧。"

    "柔软的，瘙痒的，幽香的，心动的，各种各样的感觉，都在她的身上……体验过了。"
    "简直就像是，第一次体验一样。"
    "以至于平日间毫无顾忌的肢体接触，最近开始我也不敢去做了。"

    voice "cv3/linxi/linxi_0060.ogg"
    lx "那……你把我，当成女孩子看了吗？"

    "眼睛看到的，耳朵听到的，身体接触到的，都在悄然复苏似的，口里尝到了丝丝甜味。"

    cz "嗯，毫无疑问，是的。"

    voice "cv3/linxi/linxi_0061.ogg"
    lx "嘻，嘻嘻嘻嘻~"
    voice "cv3/linxi/linxi_0062.ogg"
    lx "那你知道，我是从什么时候，把你当成男孩子看的么？"

    cz "这……"

    "不太了解，毕竟就连我自己，也是最近才意识到。"

    show cg 009 with dissolve
    voice "cv3/linxi/linxi_0063.ogg"
    lx "哎~我就知道，你完完全全没关注过我的少女心……我可是真的无数次想过，要是我也是天降就好了……但我要是天降，可能会和你完全没有共同话题，那样的话也是个悲伤的世界线啊。"

    voice "cv3/linxi/linxi_0064.ogg"
    lx "不过，那些都无所谓了。"

    "是因为接下来，就会让我知道了吗？"

    show cg 008 with dissolve
    voice "cv3/linxi/linxi_0065.ogg"
    lx "接下来，是我以一个，陪在你身边十几年的女孩子，要对你说的话……"

    "我之所以如此平和，或许是因为，我已经渐渐地，找到了属于我的道标。"
    "是的，天选试。"
    "我无法在这里结束。"
    "但如果是在天选试中，释怀了之后，我就能做到了。"
    "小涟……我的，爱人，我还是要、试一试。"
    "所以，我轻轻地，说出了口。"

    # menu:
    #     "我无法对林曦说谎":
    #         pass
    #     "可最喜欢你":
    #         pass

    cz "我没猜错的话，是不是想，让我做出选择。"
    
    show cg 007 with dissolve
    voice "cv3/linxi/linxi_0066.ogg"
    lx "嗯，可以这么理解。"

    cz "好难啊……可以给我一些时间吗？\n天选试，就快了，我想在解决一切后……再做决定。"
    cz "我真的，真的很在意你的，这绝对没有多余的意思。"

    "曦曦的眼神微微眯起，另一边的少女也看了过来，或许是错觉，我好像听到她有着松了一口气的表现。"
    "然而，等待着我的却是——"

    show cg 010 with dissolve
    voice "cv3/linxi/linxi_0067.ogg"
    lx "才——不要~~"

    "自那边传来的声压裹挟着热量，直接而精准地撞向我灵魂。"

    voice "cv3/linxi/linxi_0068.ogg"
    lx "你现在的心里，肯定还是在想着小涟吧？\n肯定还是放不下她吧……我知道的，你的事情，我全都知道！"

    cz "……"

    "无言以对。"

    voice "cv3/linxi/linxi_0069.1.ogg"
    lx "正因为如此，我才要现在说，如果不是现在的话，就没有意义了！\n我说了，要堂堂正正竞争的，陈舟，你好好给我听着。"

    "已经，无法阻挡了。"

    show cg 011 with dissolve
    voice "cv3/linxi/linxi_0069.ogg"
    lx "你知道吗，我一直，一直都是第二……以前也好，现在也好，我总是第二。\n怎么回事呢，赢不了啊，就是赢不了啊……"
    voice "cv3/linxi/linxi_0070.ogg"
    lx "但这一次，还是想要告诉你，我要让你亲眼见到，我们之间的……回忆的重量。"

    "或许我必须，要在此做出决断。"

    voice "cv3/jiangwanqing/jiangwanqing_0027.ogg"
    jwq "…………这样的进攻性，不愧是你，那我也……"

    "虽然无法理解，但这细若蚊蚋的声音，我并没有听漏。"

    show cg 007 with dissolve
    voice "cv3/linxi/linxi_0071.ogg"
    lx "我准备了好多东西，想要给你看一看。"

    "她拿出了一个旧手机，我有印象，初中的时候她似乎还在使用着。"

    voice "cv3/linxi/linxi_0072.ogg"
    lx "里面存满了从小学到高中的照片、视频，所有，所有——记录着没有修饰的、真实的你，以及永远在你身边陪着的我。"

    voice "cv3/jiangwanqing/jiangwanqing_0028.ogg"
    jwq "……咕。"

    show cg 008 with dissolve
    voice "cv3/linxi/linxi_0073.ogg"
    lx "你还记得吗，我们以前，在外面逛街……在商场里拍大头贴……一起去地下的电玩城，还被我爹妈抓到了……"

    "久远的回忆，如画卷一般在我面前铺平展开，随着她的言语，我记忆中的那些场景逐渐染上了颜色。"

    cz "啊啊，是的啊，还有一起在咖啡店里讨论游戏，在我家一起玩电脑……这么一想，我的生命里，怎么到处都是你。"
    "林曦，其实，一直都是我生命中，最重要的人。"
    "有一股暖意，自我的内核处升腾而出，逐渐地，逐渐地，净化着我的血肉。"
    "如果未来也能和她一起度过，一直一直……"
    "那将多么快乐，多么有趣，我已经能预料到了。"
    "那种未来……也不错。"

    # BGM 切换：史诗/悲伤
    play music "audio/bgm/BGM_严肃命运.ogg" loop fadein 1.0

    show cg 011 with dissolve
    voice "cv3/linxi/linxi_0074.ogg"
    lx "我……喜欢你！"

    "身体自指尖开始战栗，整个人，都宛如在进行某种蜕变。"

    show cg 008 with dissolve
    voice "cv3/linxi/linxi_0075.ogg"
    lx "恋爱意义上的，喜欢……！"

    cz "曦曦……"

    "有种自毛孔喷出的所有碎片，一瞬间合体到一起的畅快感。"

    show cg 010 with dissolve
    voice "cv3/linxi/linxi_0076.ogg"
    lx "所以——！"

    "她把手机递到我的前面，那里面，是满满的照片。"

    voice "cv3/linxi/linxi_0077.ogg"
    lx "所以，如果可以的话，我想要，堂堂正正地，得到你的爱。"
    voice "cv3/linxi/linxi_0078.ogg"
    lx "就是因为这样，我才怎么样都无法接受！"

    cz "诶？"

    "她在说什么——"

    voice "cv3/linxi/linxi_0079.ogg"
    lx "我无法接受，你的感情，是对着小涟的。"
    voice "cv3/linxi/linxi_0080.ogg"
    lx "如果是，对着正牌女友的话，那无论怎么样我都能与自己和解了……但那不是！我以前说过的吧，你是有真正的女友的。"

    voice "cv3/jiangwanqing/jiangwanqing_0029.ogg"
    jwq "——呃。"

    "什么…意思，包厢里的那次，是在说小涟啊，我的真正的女友。"
    "我已经整理好一切了……不是吗……"
    "所以你们才这样子推动我，目标明确地推动着我，明明我这些日子有这样地在思考着，在努力考虑着……"

    show cg 012 with dissolve
    voice "cv3/linxi/linxi_0081.ogg"
    lx "你这个猪头，你对小涟的爱是假的！那些失去的空白，你是在用虚假的感情填补啊……就算你没办法喜欢我，也不能去喜欢小涟，那是偷窃了你的心的骗子！是个大骗子！"

    "虚假的感情？\n填补？\n偷窃？"

    voice "cv3/jiangwanqing/jiangwanqing_0030.ogg"
    jwq "——曦曦？！"

    voice "cv3/linxi/linxi_0082.ogg"
    lx "现在你不要说话！我早就忍不了了！"

    "眼前少女们的对话，从我左耳朵进去，在脑子打着旋冲着，无法从右耳出来。"
    "我就这么僵站在原地，没有办法行动，喉咙中的话语卡在那儿，越来越向下坠。"

    voice "cv3/linxi/linxi_0083.ogg"
    lx "以前，我就赢不过晚晴……可那一次事故之后，你却把对晚晴的所有爱，所有喜欢，全部都嫁接到了小涟那里……"
    voice "cv3/linxi/linxi_0084.ogg"
    lx "要让我从这样的虚假存在身上，去赢得什么东西的话……"

    show cg 013 with dissolve
    voice "cv3/linxi/linxi_0085.ogg"
    lx "嘶，那样子，我不就……太悲惨了吗。"

    "她的泪水自脸颊滴落，其中蕴藏的温度，甚至要隔着距离将我烫伤。"

    voice "cv3/linxi/linxi_0086.ogg"
    lx "——但是！"
    voice "cv3/linxi/linxi_0087.ogg"
    lx "我的话怎样都好！我本来就！从来没有奢望过，能被你喜欢什么的，没有，奢望过……"
    voice "cv3/linxi/linxi_0088.ogg"
    lx "刚刚已经告白了，我终于终于，弥补了遗憾了，所以，以后都没关系了。"

    voice "cv3/linxi/linxi_0089.ogg"
    lx "有那一天的经历，我就满足了……牵过手了，被你主动了，甚至，还贴在一起了……这都是我，以前无法想象的事。"
    voice "cv3/linxi/linxi_0090.ogg"
    lx "真的真的，太幸福了，所以……\n啊，真的好满足，已经够了，我不能再…更贪婪了……"
    voice "cv3/linxi/linxi_0091.ogg"
    lx "说起来，这一点，还得感谢晚晴呢。"
    voice "cv3/linxi/linxi_0092.ogg"
    lx "就因为是这样的吧，我终于能说出口了，以前想对你说的，现在要对你说的，全部都说得出来了！我看不下去了……我已经，看不下去了。"

    "是我让她，看不下去。"

    voice "cv3/linxi/linxi_0093.ogg"
    lx "小涟，她明明是，我们当年一起创造的！一起做游戏，从零开始创造的角色，江晚晴可是主力啊！你这样的话，她到底要怎么样才好啊。"

    voice "cv3/jiangwanqing/jiangwanqing_0031.ogg"
    jwq "……咕。"

    voice "cv3/linxi/linxi_0094.ogg"
    lx "你们还没有分手啊！不如说，在我看来，本来是恩恩爱爱的啊！只是你自顾自地，移情别恋了！什么都忘记了，什么都不记得了，车祸以后什么都乱套了！"
    voice "cv3/linxi/linxi_0095.ogg"
    lx "不应该，不应该是这样的！一场事故，怎么会连回忆都要剥夺——"

    "宛如自我理性之外的某种存在覆盖了我的全身。"
    "本于体内拼合起来的温馨碎片，扭曲着、扭曲着、变得尖锐，"
    "自内侧起把构成我的内容物一点不剩全部挖走。"

    voice "cv3/linxi/linxi_0096.ogg"
    lx "想不起来的话，就看看这里吧，你不是，最喜欢拍照了吗？这些年你一张照片都没拍过，那也是没办法的，毕竟能拍的人都不在了……"

    "残酷的话从我身前逼近。"
    "我害怕去听。"
    "我害怕去看。"
    "不过，这是现实，我没有阻止的权力。"

    voice "cv3/linxi/linxi_0097.ogg"
    lx "她……可能觉得，没有继续喜欢你的资格吧。"
    
    voice "cv3/linxi/linxi_0098.ogg"
    lx "毕竟，当时你之所以会去参加天选试，都是因为她……"
    
    voice "cv3/linxi/linxi_0099.ogg"
    lx "可是我也…没有在你们分手之前，插手的资格……"
    voice "cv3/linxi/linxi_0100.ogg"
    lx "然后，最没有资格的，是你。"

    voice "cv3/linxi/linxi_0101.ogg"
    lx "你没有，去爱小涟的资格——"

    "像是被操控的提线木偶，我伸出手接过，就连我自己都不知道自己在做什么。"
    "拿到脸前，方才发现——"
    "那是，更小一点的我，和一个少女举着手比耶的照片。"
    "手不自觉开始滑动，呈现出来了，我从未有过一丁点印象的……画面。"
    "我和江晚晴在草地里嬉戏、我和江晚晴在对着显示屏玩Galgame、我和江晚晴在沙发上贴着百无聊赖……"
    "其中，也有一些曦曦的身影……除此之外，她、她、她、她、还有她……全都是，另一个人——晚晴。"
    "滑动着，滑动着，一直滑动到最后，究竟过了多久呢？\n我成了一具空壳，只是勉强的留存着外表——内侧的一切，已是一片漆黑。"

    cz "我没有……去，爱小涟的，资格？"

    "自言自语一般的话语，从我的嘴巴泄露出。"

    voice "cv3/linxi/linxi_0102.ogg"
    lx "科尔萨科夫综合征…替身综合征…额叶损伤……嘶，其实怎么都好，就算你把我们都忘记了，也无所谓。"
    voice "cv3/linxi/linxi_0103.ogg"
    lx "所有失去的感情都可以重新培养起来，不如说，我想要去培养，我想要去弥补……"
    voice "cv3/linxi/linxi_0104.ogg"
    lx "但是，呃，但是…但是，把你原有的感情，虚构到另一个人身上什么的，这种，这种事情，呜，对晚晴也，嘶，太残忍了吧。"

    "被晒得口干的嘴唇要裂开似的发着痛，芥末一般的苦味和清醒感自舌下渗出，我的手都在颤抖着。"
    "小涟，我的……女友，我的爱人……明明是……"
    "明明是……一见钟情……"

    # --- POV 切换 ---
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    scene bg riverside_road2 with Dissolve(1.5)
    
    # 切换至江晚晴视角，不显示江晚晴立绘，只显示林曦
    $ lx.show("平静带怒", pos=center)

    voice "cv3/jiangwanqing/jiangwanqing_0032.ogg"
    jwq "不要……再说了。" # 江晚晴此时是POV，只有台词

    "你根本没有必要为我做这些事，从前开始，我就一直把你看成对手。"

    voice "cv3/linxi/linxi_0105.ogg"
    lx "我还说十遍、一百遍才够，我还有更多，更多的……"

    voice "cv3/jiangwanqing/jiangwanqing_0033.ogg"
    jwq "曦曦！"

    "明明你是……最喜欢他的。"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0106.ogg"
    lx "可是……"

    "她咬着嘴唇一脸挣扎的样子，让我想要扯出一丝微笑去安慰她，一旦想到这幅表情是为了我，就只能感到心痛了，而在那之上的，还有一份自惭形秽。"

    voice "cv3/jiangwanqing/jiangwanqing_0034.ogg"
    jwq "忘记了医生说的吗，不要再…刺激，等到……精神稳定了……"

    $ lx.show("平静带怒")
    voice "cv3/linxi/linxi_0107.ogg"
    lx "……几年过去，该稳定的，早稳定了。"

    "啊啊，我早就知道的，这就是林曦。"
    "她可爱，靠谱，有热度，善良……绝对以身边的人为第一优先级。"
    "哪怕，那个人是我。"

    voice "cv3/jiangwanqing/jiangwanqing_0035.ogg"
    jwq "你不要再……逼他了。"

    "我看向阿舟，他伫立于原地，双眼空虚无比地看着手上的机器，宛如莫大的寂寞包裹了他的躯体。"
    "现在这幅模样，很明显是认知失调达到峰值时的解离反应，自我保护机制在强制关机，以防精神崩溃。"
    "只是这样，便让我心如刀割。"
    "笨蛋。"
    "我只想看到你笑的样子。"

    voice "cv3/jiangwanqing/jiangwanqing_0036.ogg"
    jwq "逼迫身心苦事多，哀声无地可号呼。肝肠断处情难断……"
    "血泪枯时情未枯。"

    voice "cv3/jiangwanqing/jiangwanqing_0037.ogg"
    jwq "我已经无法接受，哪怕是一点点的、一点点往坏处走的可能了。"

    "我是很坚强的女人。"
    "但我怎样都无法亲眼看着，阿舟的身上，可能有悲剧降临。"

    voice "cv3/jiangwanqing/jiangwanqing_0038.ogg"
    jwq "你明明应该，去覆盖那段感情的……我一直，是这么认为的。"
    voice "cv3/jiangwanqing/jiangwanqing_0039.ogg"
    jwq "这绝对是最好的选择。"

    $ lx.show("鼓嘴气气")
    voice "cv3/linxi/linxi_0108.ogg"
    lx "那样的选择，我才不要。"

    "或许她比我要更坚强。"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0109.ogg"
    lx "还不如…回到以前的时候，哪怕，再也没有我……"

    "眼前的少女身体纤细，她没说完的话语，让我意识到其灵魂究竟是有多么庞大。"

    voice "cv3/jiangwanqing/jiangwanqing_0040.ogg"
    jwq "不可能的了，心啊，念啊，奇迹什么的，怎么可能对抗现代医学诊断……"
    "我什么都祈求过了，哪怕是在天选试上，所以我才清楚，那所谓的沟通神明也终归是假的，只是一个仪式感。"
    "当年的感情，全部转移到了小涟的身上，就连回忆也……消失殆尽。"

    voice "cv3/jiangwanqing/jiangwanqing_0041.ogg"
    jwq "他——绝对不可能想起我了。"

    "只是单单这样说出口，眼底的热量就按捺不住想要倾泻而出。"

    voice "cv3/jiangwanqing/jiangwanqing_0042.ogg"
    jwq "呼，我能够，求你一件事吗。"

    "我深吸了一口气，斟酌着语言。"

    $ lx.show("平静")
    voice "cv3/linxi/linxi_0110.ogg"
    lx "你可以说。"

    voice "cv3/jiangwanqing/jiangwanqing_0043.ogg"
    jwq "我希望你可以一直陪着他，不是代替我的意思，是作为你自己，这样。"

    voice "cv3/linxi/linxi_0111.ogg"
    lx "我一直都是这么做的。"

    voice "cv3/jiangwanqing/jiangwanqing_0044.ogg"
    jwq "那，我换一个。"

    "是我多嘴了。"

    voice "cv3/linxi/linxi_0112.ogg"
    lx "嗯，你要拜托我什么。"

    voice "cv3/jiangwanqing/jiangwanqing_0045.ogg"
    jwq "可以的话，不要在他面前提起我了，就像前几年那样，这次是我的不是，抱歉，贸然搅局。"

    voice "cv3/linxi/linxi_0113.ogg"
    lx "我倒是想感谢你的……而且，天选试就快了，不是说好的，那是一个契机么？或许到那个时候……"

    "我摇了摇头。"

    voice "cv3/jiangwanqing/jiangwanqing_0046.ogg"
    jwq "没关系了，只要有你在，我就完全放心了。"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0114.ogg"
    lx "但是我想要……"

    voice "cv3/jiangwanqing/jiangwanqing_0047.ogg"
    jwq "曦曦。"

    "我无比严肃，又尽可能温柔地看着她。"

    voice "cv3/jiangwanqing/jiangwanqing_0048.ogg"
    jwq "到那时，指不定他会怎么想，总之，我希望你尽可能先考虑你自己。"

    "她沉默地看向我。"
    "而我毫无动摇地对视了回去。"
    "只是过了一会儿，她就叹了一口气。"

    $ lx.show("鼓嘴气气")
    voice "cv3/linxi/linxi_0115.ogg"
    lx "反正他都知道了，我不管了，我可是很自私的，才不想提起你呢，哼。"

    voice "cv3/jiangwanqing/jiangwanqing_0049.ogg"
    jwq "呵呵，那就好。"

    "最后，再让我说点任性的话。"

    voice "cv3/jiangwanqing/jiangwanqing_0050.ogg"
    jwq "既然这样，要不，再答应我一件事。"

    $ lx.show("无语")
    voice "cv3/linxi/linxi_0116.ogg"
    lx "呃——有一有二还有三？你的脸皮怎么这么厚，我记得你以前可是冰山冷美人来着……"

    voice "cv3/jiangwanqing/jiangwanqing_0051.ogg"
    jwq "哎呀哎呀~毕竟是我嘛。"

    voice "cv3/linxi/linxi_0117.ogg"
    lx "……我最不喜欢的就是你这副一切尽在掌握的样子了。"

    voice "cv3/jiangwanqing/jiangwanqing_0052.ogg"
    jwq "是吗？我可是很喜欢曦曦的哦，不管哪个方面。"

    "我的话语全无一丝虚假。"

    $ lx.show("叹气")
    voice "cv3/linxi/linxi_0118.ogg"
    lx "唉~~行吧，行吧，你说吧。"

    $ lx.show("平静")
    "不好意思了，就让我任性一次。"
    "余光不自觉地看向阿舟那边，将其身躯包含进来的那刻，悲伤如波涛般涌向我。"
    "这种痛楚，并不是第一次。"
    "我清楚，就像人无法违抗大自然一样，人必须学会补救，而不是对抗。"
    "阿舟无法选择，会那么迷茫，并不是他的错。\n只是因为我们在逼迫他，随着逐步紧逼，看得出来，他或许到极限了。"
    "但，无论是什么结果，最终都和我无关。"

    voice "cv3/jiangwanqing/jiangwanqing_0053.ogg"
    jwq "曦曦，请你把我……"

    "我在此挣扎，为自己的选择而痛苦。"
    "但是，我和他不一样，我必须选择。做出属于我个人的，属于江晚晴这个女人的选择。"

    voice "cv3/jiangwanqing/jiangwanqing_0054.ogg"
    jwq "把我所有的痕迹，都抹去吧。"

    $ lx.show("忧伤")
    voice "cv3/linxi/linxi_0119.ogg"
    lx "唉？你，你又要走吗。"

    "她的神色一下就黯淡了下来。"
    "我又何尝不是一样，除了阿舟以外，曦曦，你也是我最好的朋友。"

    voice "cv3/jiangwanqing/jiangwanqing_0055.ogg"
    jwq "天选试后，我有应尽的义务。"
    voice "cv3/jiangwanqing/jiangwanqing_0056.ogg"
    jwq "别担心，什么都已经安排好了，赠品角色的退场不会有什么问题的，说起来，以前还真忘了这一茬，不过，这一回我可不会忘了。"

    voice "cv3/linxi/linxi_0120.ogg"
    lx "可那些记录明明是你……"

    "是我最珍贵的回忆。"
    "没错，但是……"

    voice "cv3/jiangwanqing/jiangwanqing_0057.ogg"
    jwq "只要存在这里，就可以了。"

    "我指了指胸口。"

    voice "cv3/linxi/linxi_0121.ogg"
    lx "……"

    "再一次，我看向阿舟，他在喃喃自语说着什么。"
    "我转过头去，越过林曦的肩望了望天空，夕阳刺眼。"
    "然后，我挺起胸膛，说道。"

    voice "cv3/jiangwanqing/jiangwanqing_0058.ogg"
    jwq "之后，就交给你了。"

    # --- 结束 ---
    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ lx.reset_position()
    $ jwq.reset_position()
    $ xl.reset_position() 
    return