label end2:

    cz "我要……让小涟被所有人都认知到。"

    "这是我第一时间想到的愿望，也是我……一直以来的执念。"
    "语气虽轻，却毫无动摇。"
    "我只是诚实地，又带着一点释怀地，说出了这一句话。"
    "神明…正注视我。"
    "我不敢，不敢有半分欺骗的意愿。"
    "哪怕仅是升起这个念头，都是对祂最大的不敬。"
    "既然如此，那不就只能直面本心了吗？"
    "小涟，我的本心，无论如何，我都无法放开小涟的手……"
    "温暖的气息，自我侧边传来。"
    "哪怕是不用眼睛去看，光是凭借生物本能，就已经在一瞬间理解。"
    "这样子的……熟悉的……安心的……感觉。"
    "……"


    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)

    # --- 卧室场景 ---
    # 使用比较安静的日常或治愈系BGM
    play music "audio/bgm/BGM_安慰.ogg" loop fadein 1.5
    show bg room1_4 with dissolve

    "喜欢这种感情，是无法用理性去分析的。"
    "为什么会喜欢上那个人？"
    "脸蛋可爱、性格温婉、相处愉快……"
    "为什么会喜欢上那部Galgame？"
    "美术风格、声优演技、剧本素质……"
    "不管是谁，都能想出很多答案吧。"
    "但真的是那样吗？"
    "如果出现一个脸蛋更可爱，相处更愉快的人，就会比前者更具有优势？\n人就会马上移情别恋？"
    "不对的。"
    "喜欢这种感情，没有那么简单。"
    "不是因为谁性格好就会喜欢上谁，哪怕别人和自己相处再愉快，也不一定会喜欢上对方。"
    "只是因为自己喜欢的人，恰好具备了那些优点而已。"
    "喜欢是无可预测的。"
    "没有为什么，不需要理由。"
    "不单单只有恋爱，任何事情都是这样。"

    # --- 小涟登场 ---
    $ xl.show("卖萌惊讶", pos=center)
    "然而眼前的少女，却抱着满脸纠结的表情，想要对我提出疑问。"
    "哪怕，她早已知道我的回答。"
    "唉~~谁叫我喜欢她呢，真是的，除了觉得可爱以外，不存在多余的想法了。"

    voice "cv3/xiaolian/xiaolian_0063.ogg"
    xl "为什么，会选我……明明已经下定决心了，要过上新的生活不是么？"

    "这或许只是她的确认吧，对于这个问题，无论问多少次，我的回答都是一样的。"

    cz "非你不可。"
    cz "因为……我喜欢你。"

    $ xl.show("卖萌惊讶")
    voice "cv3/xiaolian/xiaolian_0064.ogg"
    xl "可是我，只是一部Galgame中的角色哦，而且而且，你喜欢我的感情，大概只是出了什么问题……"

    "作为一个「人」而被抛入这个世界，她一定是，感到不安的。"
    "所以，我必须用无限大的包容，以及无限大的肯定，去支撑她。"

    cz "Galgame角色是点阵、是数据、这种事情我知道。\n那别人喜欢的那个女孩又是什么？蛋白质？钙？\n探寻本质是愚蠢的，重要的是充满爱的心。"
    "荒谬么？正是因为荒谬，所以才要选择相信。"
    "早就该，跃出这一步了，啧，3年么……真是好长、好长的路途啊。"

    cz "无关什么道德，回忆，情感，我自己的意志这般对我说，你一定要是那个去爱小涟的人。"
    cz "就是这样。"
    cz "所以，我爱你。"
    cz "至死不渝。"


    $ xl.show("卖萌哭哭")
    $ xl.act(anim_jump)
    voice "cv3/xiaolian/xiaolian_0065.ogg"
    xl "啊呜啊呜。"

    "看着她说不出话的模样，我心里感到十分充实。"
    "更何况，现在的小涟，可是货真价实的女孩子，而不仅仅是我的脑内幻想了。"
    "说她是Galgame中的角色，是不符合现实的……"
    "待到缓了一会儿后，她才带着一些感慨的神色，微微张口。"

    $ xl.show("卖萌气气")
    voice "cv3/xiaolian/xiaolian_0066.ogg"
    xl "才不管你，你喜欢……就喜欢吧。"
    
    $ xl.show("卖萌叹气")
    voice "cv3/xiaolian/xiaolian_0067.ogg"
    xl "只是，那个，你身边不是还有两个、女孩子吗，她们两个明明……"

    cz "小涟。"

    $ xl.show("卖萌惊讶")
    voice "cv3/xiaolian/xiaolian_0068.ogg"
    xl "唉？"

    "我叫住了她，以很严肃的口吻说道。"

    cz "不要小看她们哦，她们是我……很尊敬的人。"

    $ xl.show("温柔")
    voice "cv3/xiaolian/xiaolian_0069.ogg"
    xl "哦？哦。"

    $ xl.hide()
    
    "那天过后，我退出了殿试，也拒绝了国家总统的邀请，婉拒了重职，同时，也离开了林曦，还有江晚晴。"
    "……不对，这里应该换一种说法，并不能算是离开。"
    "只是我们彼此聚在一起，很平和地阐述了自己接下来的打算。"
    "江晚晴……她早就是那么准备的，我不得不感叹，我的一举一动，都在她的意料之中。"
    "回头想来，这位少女的计划一直有在切实地履行，她斡旋于我们三人之间，达成了自己的目的，她早就同这个世界，也同自己和解了。"
    "只是，最后离开时的那一眼……惊鸿一瞥，给我带来了极其深刻的震撼。"
    "像烙印刻进心底，怕是此生都难以抹去。"
    "现在的江晚晴，听说在一家Galgame公司背后操纵着产业相关的事情，似乎打算专精萌作。"

    "而林曦……她……可能还需要一点时间去抚平。"
    "我知道的，她虽然表现得一副无所谓的样子，但是，用调侃和卖萌掩盖自己的真心是这家伙的老习惯了，呵呵，怎么可能骗得过我。"
    "回去后可能会哭吧，可如果是林曦的话，那个比谁都温柔的林曦，一定能走出来的。"
    "因为——温柔是一种强大。"
    "活了这么多年，我很少遇到和萌作男主一般温柔的家伙，哪怕他们经常被玩家说废，但我很清楚，他们都是厉害的人，是我无法成为的，厉害的人。"
    "想做，能做，和真的去做，三者间差别堪比天地，\n「可以做到」没有任何意义，只有「真正做到」才是温柔。"
    "在他人痛苦时伸手帮助，在他人迷茫时提供鼓舞，在他人寂寞时给予拥抱……正是因为动画里、游戏中，处处都是这样的人，所以才会让人轻视，轻视这些，百中无一的特质。"
    "林曦是个温柔的人，所以，她不会有问题的，\n她作为「人」的强度，比我高太多、太多。"


    $ xl.show("温柔", pos=center)
    cz "……她们是坚强的女人，所以，不用担心她们的。"

    $ xl.show("卖萌叹气")
    voice "cv3/xiaolian/xiaolian_0070.ogg"
    xl "唔……既然你这么说的话……"

    cz "比起这个，更重要的是……"

    $ xl.show("卖萌疑惑")
    voice "cv3/xiaolian/xiaolian_0071.ogg"
    xl "嗯？"

    play music "audio/bgm/BGM_欢快2.ogg" loop fadein 1.0

    cz "这些天又是准备天选试啊，又是被各种人打扰啊，我的萌萌人日常都消失好几个月了，萌作能量严重不足呀。"
    cz "所以说……"
    cz "桀桀桀，你都获得肉体了，我们好像还没亲热过——"

    $ xl.show("卖萌惊讶")
    $ xl.act(anim_shake) # 表现惊吓震动
    voice "cv3/xiaolian/xiaolian_0072.ogg"
    xl "唉……啊！"

    "我直接把她扯到身边，然后推倒在床上。"
    
    
    $ xl.hide()
    with flash
    $ xl_l.show("抽泣")

    "秀发披散于床边，纯白无垢，好似花朵绽放，她裸足微微弓着，双腿并拢，捏着衣角有些颤抖。"
    "像是揉开的花瓣一般，自少女那传来了好闻的香味，一经吸入，甚至让人感觉室温都升高了些许，我体内深处也开始燥热起来。"

    voice "cv3/xiaolian/xiaolian_0073.ogg"
    xl "啊呜，可是，可是……"

    cz "？"

    "小涟眼里蒙着水雾，明明是如往常那般娇艳欲滴、引人探索的样子，但身体却像是违背了主人的意志，带着些瑟缩、谨慎的感觉。"

    voice "cv3/xiaolian/xiaolian_0074.ogg"
    xl "我…我……"
    voice "cv3/xiaolian/xiaolian_0075.ogg"
    xl "我还是…第一次……"

    cz "……"
    "第、第一次？"
    "……你？"

    voice "cv3/xiaolian/xiaolian_0076.ogg"
    xl "我才…刚刚……出生呢……"

    cz "……"
    "我沉默了。"
    "要不…还是用Galgame算了……"
    "而就在我思绪往上飘的刹那，自我身下裤腿处，传来了微微的拉扯感。"
    "——是小涟。"

    $ xl_l.show("害羞")
    voice "cv3/xiaolian/xiaolian_0077.ogg"
    xl "所以……"
    voice "cv3/xiaolian/xiaolian_0078.ogg"
    xl "你……轻一点哦，不要…把我玩坏哦……"

    "她，咬着嘴唇，轻微地，缓慢地，把腿伸直——"

    cz "……"
    cz "…………！！！"

    "——我扑了过去。"

    window hide
    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ achievement.grant("ACH_05")
    $ achievement.sync()
    
    # 显示End字样
    $ script_box_alpha = 0.0
    centered "{size=40}Normal End：{space=50}和小涟恩恩爱爱贴贴度过一生{/size}"
    $ script_box_alpha = 1.0
    return