label end3:
    
    
    cz "请让我，回归正常的生活，回到……以前的生活。"
    
    "——等同于，要将小涟抹去一般的话语。"
    
    "残酷的话语。"
    
    "连声音也听不见了，世间的一切，自己的心跳，还有脑袋里回想的思考，在我真的说出这句话后，通通被月光冻结。"
    
    "咦？"
    
    "为什么呢？"
    
    "我的眼前，为什么模糊了？"
    
    "……"
    
    "大抵，是被风沙给迷了眼吧。"
    
    "我仿佛看到那尊神祇微微歪了歪头，这到底是……什么意思呢，是同意么？"
    
    # 指示：溶解在月色中，消失。使用白色闪烁特效
    scene bg noctella_background with pixellate
    
    stop music fadeout 2.0
    "而后——祂，溶解在月色中，消失了。"
    
    "……"
    
    scene bg heavenly_altar_focus with Dissolve(2.0)
    play music "audio/bgm/BGM_治愈.ogg" loop fadein 1.5
    play sound fx.crowd loop fadein 1.0
    
    "呼——"
    
    "我吸入一口晚间的空气，能够听见，自天选台下传来的嘈杂声音。"
    
    cz "（今天，这辈子都忘不掉了。）"
    
    stop sound fadeout 2.0
    "看向周围，空空荡荡，突然感觉，站在空荡世界中的自己，有些冷。"
    
    "被风吹得有些冷。"
    
    "人类的成长，归根结底，就是无数次与过去的自己告别。"
    
    "并非拒绝，而是承认，承认过去的一切，承认不成熟的自己，一边品尝着遗憾的滋味，一边通过遗憾警醒当下。"
    
    "无法舍的家伙，当然也无法得。"
    
    "放手不是弄丢过去，而是让那些过去，以另一种姿态——比如克制，比如勇气，比如清醒——重新活在此时此刻。"
    
    "这种告别，是一种深刻的成全。"

    "在老旧自我的碎裂处，才能真正认清生命的底色。"
    
    "小涟，我重要的人，我爱过的人，我无法忘记的人。"
    
    "以后，就将她放进心底吧。"
    
    "身体变冷了吗？"
    
    scene bg heavenly_altar with Dissolve(2.0)
    "——去那里。"
    "去那里吧。"
    
    "那里，有着会温暖我的人。"
    
    "也是我重要的人。"
    
    "而且，会变得越来越重要也说不定。"
    
    "……哎，曦曦，晚晴，抱歉了。"
    
    "我还是需要依赖你们，所以，以后肯定会麻烦你们许多许多。"
    
    "听你们说，这是好事，既然如此，这样就好。"
    
    "我下了天选台，找来工作人员，将周围之人隔出一段距离。"
    
    "终于，我来到了她们身边。"
    
    "真是好长……好远的，一条路啊。"
    
    "我有资格，站在她们身边了吗？"
    
    # --- 角色进场 ---
    $ lx.show("忧伤", pos=left)
    $ jwq.show("落寞", pos=right)
    
    voice "cv3/linxi/linxi_0158.ogg"
    lx "舟子……"
    
    voice "cv3/jiangwanqing/jiangwanqing_0132.ogg"
    jwq "……阿舟。"
    
    "外层的人影宛如隔着磨砂玻璃一般，成了纯粹的背景。"
    
    "我的视野里，只有她们。"
    
    "夜风吹过，清辉洒下。"
    
    "有一层月色的薄纱，披在她们身上。"
    "我感受到了指引。"
    
    "于是，我轻轻地，对她们笑了笑。"
    "希望是一个灿烂的笑容。"
    
    # 指示：露出了安心的表情
    $ lx.show("闭眼微笑")
    $ jwq.show("微笑")
    
    "然后，她们也松了口气似的，露出了安心的表情。"
    
    "真好。"
    
    "那么以后，就带着这种温暖的心情，活下去吧。"
    
    "活在一个有你们二人的世界。"
    
    "变得坚强的我，和让我变得坚强的你们，又将碰撞出怎样的火花呢？"
    
    "晚晴，我不会让你走的。"
    
    "曦曦，说起来，我还没给你回复。"
    
    "……嗯，我想到了一个好方法。"
    
    "但是，现在的我，还不够资格。"
    
    "心灵的强度，必须要胜过她们才行。"
    
    cz "呵呵……"
    
    "这下，就有新的目标了。"
    
    "努力吧。"
    
    "要比天选试，更加努力。"
    
    "——为了那个，我期望中的未来。"
    
    window hide
    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ achievement.grant("ACH_06")
    $ achievement.sync()

    # 显示End字样
    $ script_box_alpha = 0.0
    centered "{size=40}Normal End：{space=50}和两位美少女一起的新生活{/size}"
    $ script_box_alpha = 1.0
    return