label interlude2:

    scene bg school1 with dissolve
    play music "audio/bgm/BGM_日常7.ogg" loop fadein 1.0
    
    "过了一阵子。"
    "学校里的目光渐渐适应了些，喧闹也好，调侃也罢，随着日出日落，终究会飘散大半。"
    "还有些闲言碎语，可能还需要一些时间淡化。"
    "本来还以为所谓的「现实Galgame」会给我整出点大活儿，结果也没发生什么，就是大家聚在一起普普通通聊天而已。"
    "现在的我，和两位少女呆在一起，江晚晴和林曦坐在我的旁边，大中午的午休时间，在学校的一个角落处，开着我们的小团体会议。"

    $ lx.show("惊讶", pos=left, x_offset=250)
    voice "cv2/linxi/linxi_0032.ogg"
    lx "攻略伪娘的Galgame，也是Galgame？"

    $ jwq.show("游刃有余", pos=right, x_offset=-250)
    voice "cv2/jiangwanqing/jiangwanqing_0053.ogg"
    jwq "当然，Galgame岂是如此不便之物？像这样的Galgame自然也是存在的，甚至说，有一部叫《重生萝莉岛》的游戏，在贵族的圈子里……"

    "我们已经聊了相当的久，这还真难得，居然有人能和我在Galgame的话题上沟通如此之多。"
    "而这会议的内容，则是为了辅助我的天选试之旅，而进行的战略大辅导。"
    "只是曦曦在旁边不怎么插得进话，偶尔才会发表一些疑问。"

    cz "曦曦，你这就不懂了，就连和虫子交往啊，在岛国战国攻城略地啊，甚至卡牌游戏之类的各种奇奇怪怪的玩意都可以是Galgame哦。"
    cz "区区男娘又算得了什么呢？起码人家还是立绘插画文字框的标准流派。"

    $ jwq.show("微笑")
    voice "cv2/jiangwanqing/jiangwanqing_0054.ogg"
    jwq "呵呵，阿舟，看来，你的确有成为Galgame领域大神的潜力。"

    "她颇为赞同地点了点头。"

    cz "那是自然，我寻思，我们的水平不一定就差别多大。只不过我没参加天选试而已，等着吧，再过一阵子，我也是现役了。"
    "就算她各个意义上都算是我的前辈，但怎么说大家都同龄人。"
    "我想要追上她的身影，此时只能以挑眉予以回应，起码嘴上不能服输。"

    $ jwq.show("游刃有余")
    voice "cv2/jiangwanqing/jiangwanqing_0055.ogg"
    jwq "唉~我觉得，你还是先净化一下你的废萌思维吧。"

    "不过，人家在Galgame这条路上走在我的前头，倒也是无可置疑的事实。"
    "说起来，她叫着叫着，我也有点习惯她直接叫我阿舟了。"

    $ lx.show("无语") # 映射“感慨”
    voice "cv2/linxi/linxi_0033.ogg"
    lx "Galgame的世界…可真神奇啊……果然，我无论如何，都还是无法融入进去你们的话题……"

    $ jwq.show("微笑")
    "江晚晴颇为赞赏地对我点了点头。"

    voice "cv2/jiangwanqing/jiangwanqing_0056.ogg"
    jwq "本来只是想了解一下你的Galgame知识有没有退步，现在看来确实是有在用功的，我放心了。"

    cz "额，我们才认识这么几天，就算真退步也退步不到哪儿去吧。"
    "虽然感觉和她默契很高。但她总是会说出一些或深奥、或让我摸不着头脑的话来。"
    "听闻Galgame领域大神多少都有点与众不同，这说法果不其然是真的。"

    cz "对了曦曦，你不是也已经开始玩一点Galgame了吗？我还以为你也多多少少喜欢上了一点呢。"
    "曦曦多数时候都是在旁边坐着听，无所事事的样子，好像单纯只是在陪着我，我多少有点过意不去。"
    "是因为之前的个人线宣言，让她的心态发生了变化吗？"
    "明明没有什么事做，对我们这些Gal相关的话题也插不进嘴，她自己去午休就行了的，没必要一直待在我这边。"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0034.ogg"
    lx "啊你说这个啊，我的感受力不行呢，只能玩一点废萌了，没什么好讨论的吧。"

    "这话我一听，可不能当没听见。"
    cz "错！废萌才是真正值得讨论的！要知道，恋爱可是非常美丽的事物！美少女更是世间一切善与美的结晶，这是常识吧！和美少女谈恋爱的作品怎么能够轻视？！"

    $ lx.show("白眼")
    $ jwq.show("叹气")
    "……两边均传来了白眼。"
    "好吧，当我没说。"

    $ jwq.show("微笑")
    voice "cv2/jiangwanqing/jiangwanqing_0057.ogg"
    jwq "一直学习Galgame，压力太大了也不好，我们去休息一下，走，午休还有一个小时，去外面约会去。"

    $ lx.show("开心")
    voice "cv2/linxi/linxi_0035.ogg"
    lx "啊！走吧走吧，与其听你们一直聊这些奇奇怪怪的东西，还不如去喝点奶茶。"

    "我也没意见，于是站了起来，朝外走去。"
    "就在这时，我敏锐地察觉到江晚晴脸上流露出的温和神情，那是一种沉浸在当下氛围中，不自觉放松下来的神情。"
    "之所以能察觉，是因为这种情绪，我最常在曦曦脸上捕捉到。"
    "但此刻，江晚晴居然也对我们露出了同样的表情？"
    "难道说就这么几天时间，她就已经把我们当成好朋友了……唔，这是不是有点太容易攻略……哦不是，太容易卸下心防了？"
    "作为刚接触不久的人，我对她还是抱有一点距离感。"
    "两边的温度差让我觉得有点微妙。"
    "虽然她确实很好看，所以我总是控制不住自己去看她就是了……"
    "……话说，我居然看她的脸看得这么认真么。"

    # ================= 场景：餐厅（校外街道） =================
    # 由于资源列表暂无餐厅，使用街道2白天作为替代
    scene bg tearoom with fade

    "我们点了几杯饮料，在校外悠闲地享受午间时光。"

    $ jwq.show("平静", pos=right)
    voice "cv2/jiangwanqing/jiangwanqing_0058.ogg"
    jwq "你居然会去玩Galgame，哪怕是废萌也让人难以想象啊。"

    $ lx.show("平静", pos=left)
    voice "cv2/linxi/linxi_0036.ogg"
    lx "人都是会变的啦……"

    cz "呵呵，你之前找我要游戏推荐的时候，我真是惊得不行。"
    "当时我反复确认了好几遍，才认知到曦曦原来说的是认真的。"
    "毕竟她从小对Galgame的兴趣真不大，相比起屏幕里的世界，她更喜欢和别人一起玩。"
    "结果突如其来找我推荐Galgame，而且还是废萌，真是让我丈二和尚摸不着头脑。"
    "我确实是希望能多一个同好，还挺开心的，但毕竟是废萌……"

    $ jwq.show("游刃有余")
    voice "cv2/jiangwanqing/jiangwanqing_0059.ogg"
    jwq "心态转变了？有什么契机么。"

    $ lx.show("害羞") # 映射“扭捏”
    voice "cv2/linxi/linxi_0037.ogg"
    lx "倒也没有……这个都不重要，反正就是心血来潮嘛。"

    $ jwq.show("眯眼")
    voice "cv2/jiangwanqing/jiangwanqing_0060.ogg"
    jwq "嚯~？"

    "曦曦侧过脸去，扭头吸起了奶茶。"
    "总感觉眼神躲躲闪闪的啊……这种机会怎么能放过。"

    cz "哎哎哎！对了，就是这个，心血来潮，我也很好奇啊，心血来潮也应该有个契机吧！"
    "嘿嘿，本来不好奇的，你这种态度，岂不是都让我好奇起来了。"

    $ lx.show("害羞")
    voice "cv2/linxi/linxi_0038.ogg"
    lx "其实，其实……就是……"

    $ jwq.show("计划通")
    "我看向江晚晴，她也看向我，我们相视一笑，都没有说话。"

    voice "cv2/linxi/linxi_0039.ogg"
    lx "Galgame嘛，毕竟是那个，怎么说呢，毕竟是那么高级的艺术……"
    voice "cv2/linxi/linxi_0040.ogg"
    lx "然后然后，就算以前认知不到，随着成长啊，随着学习呀……终归还是，还是认识到了，大，大概……"

    $ lx.show("欲言又止")
    voice "cv2/linxi/linxi_0041.ogg"
    lx "哈哈哈哈哈——"

    cz "……"
    voice "cv2/jiangwanqing/jiangwanqing_0061.ogg"
    jwq "……"

    $ lx.show("萌怒")
    $ lx.act(anim_shake)
    voice "cv2/linxi/linxi_0042.ogg"
    lx "呜——你们怎么都不说话。"

    cz "……"
    voice "cv2/jiangwanqing/jiangwanqing_0062.ogg"
    jwq "……"
    "请绷住，陈舟，现在要忍耐，不能笑，千万不能笑，现在笑出声的话，一切就结束了，我在心里对自己这么说道。"
    "啧，江晚晴那边倒是纯粹的扑克脸，这家伙是真厉害，是不是只要她想，任何事都无法动摇她。"
    "随着沉默让空气愈加凝实，曦曦终于是忍不住了。"

    $ lx.show("害羞")
    voice "cv2/linxi/linxi_0043.ogg"
    lx "硬，硬要说的话，除此之外的理由，也不是没有。"

    cz "……"

    voice "cv2/linxi/linxi_0044.ogg"
    lx "废…废萌的话，就是，就是那个，谈恋爱的嘛……"
    voice "cv2/linxi/linxi_0045.ogg"
    lx "而且，女主角都是非常有魅力的……非常讨男孩子喜欢的……"

    "咦？刚刚，她是不是瞥了我一眼。"

    voice "cv2/linxi/linxi_0046.ogg"
    lx "我，我就想着，说不定，我，我可以从她们身上，学到很多经验……你看嘛，我是女孩子，不太懂男生到底是怎么想的，所以废萌这样的作品，对我来说可能意外地有用。"
    voice "cv2/linxi/linxi_0047.ogg"
    lx "就是……我可以学习到，男孩子到底喜欢什么样的人，他们希望能从中获得什么……然后，然后……"

    $ lx.show("害羞")
    voice "cv2/linxi/linxi_0048.ogg"
    lx "然后我就可以，朝那个方向去努力……"

    play sound fx.heartbeat
    "哎？为什么，是看着我说的。"
    "忽然间，我们视线相对。"

    $ lx.show("萌怒")
    $ lx.act(anim_jump)
    voice "cv2/linxi/linxi_0049.ogg"
    lx "哇，才发现，居、居然喝了这么多饮料，我去趟厕所！！"

    $ lx.hide()
    $ jwq.show("落寞")
    "——嗖的一下，她跑没影了。"
    cz "……"

    voice "cv2/jiangwanqing/jiangwanqing_0063.ogg"
    jwq "这家伙，真是不好对付。"

    cz "咦？"
    "额，我听错了？不对啊，我身体这么好，不太可能。"

    $ jwq.reset_position()
    $ jwq.show("挺好颜", pos=center, x_offset=0, zoom=2, transition=dissolve, y_offset=2100)
    play music "audio/bgm/BGM_孤独夜晚.ogg" loop fadein 2.0
    voice "cv2/jiangwanqing/jiangwanqing_0064.ogg"
    jwq "没什么，说起来，我们二人终于可以过二人世界了……"

    cz "哦哦。"
    "算了，都是小问题。"

    "……"
    "没有、下文。"
    "什么都没发生。"
    "接下来，我们二人都没有说话。"
    "这家店就在学校边上，我可以察觉到旁边偶尔会有一些窃窃私语传来，还有时不时掠过、却不敢停留太久的视线。"
    "大抵，是对面这位的原因吧。"

    $ jwq.show("平静")
    "江晚晴……"
    "见我看去，她没有回应，只是浅浅地抿着杯子，似是眼前的咖啡更加重要。"
    "我感受着对面传来的气息，看向窗外。"

    "相对于她的身份而言，这样子的态度任何人都不会感到意外。"
    "反倒是之前那种贴在我身边的情况，才是真的让我心底发怂，都快怀疑是不是被盯上做了局。"
    "我用余光扫视着她。"

    "江晚晴点了一杯冷萃咖啡，这是一种在低温里慢慢释放的类型，在长时间内都具备后劲……待到喝下去的人察觉到时，早已渗透进每一次呼吸。"
    "她也是。"

    "看起来冷静、疏离，像什么都没发生，像一切尽在掌控。"
    "但位于其对面的我，偶尔刻意去扫过她的脸庞时，却有着截然不同的体会。"
    "只要坐在桌前，就算不用语言和特定的暗号交流，有些东西也能像空气一样传达过来。"

    "她的指尖始终扣在杯壁最外侧，杯中的冰块早已不再作响，咖啡表面平静得几乎没有波纹。"
    "只能见到她偶尔抿一口，又很快放下。"
    "并不是因为不合口味，更像是在控制节奏。"
    "我注意到她的目光并没有真正落在桌面，而是看着某个并不存在的点，视线略微偏移，却始终避开了我。"
    "仿佛只要再偏移一点，就会越界。"

    "呵呵，和我一样么？"
    "不知怎么的，我感到一种放松，这是种和其他人在一起时，截然不同的放松感。"
    "就像是我在看着窗外的同时，也在余光看向她，说不定，她也同我一样，正用余光看向我呢。"
    "直觉么，嗯，我想，或许不是直觉吧……"
    "店里的声音很杂。"
    "勺子碰到瓷盘的轻响、隔壁桌压低的笑声、门被推开时带进来的风。"
    "各种音量交织在一起，可偏偏像是绕过了我们，在靠近这张桌子时，自觉轻了下来。"
    "我们这桌，安安静静。"

    "忽然间，我意识到了，这不是在等待对方开口说话，扯些家长里短的那种气氛。"
    "她是不是也意识到了这一刻的存在？"
    "意识到了，所以，才会这样，只是感受着对方。"

    cz "……"
    cz "（二人、世界么……）"
    "二人世界，或许正如她所说，用这个词语来形容，大抵是没错的。"
    "听说真正关系深厚的人， 并不是在一起就有聊不完的话题。"
    "无话不谈是投缘的证明，但可以同享安静的片刻，才是更深刻的心意……"
    "这是真的吗？"

    "福至心灵，我莫名确信，她知道我正在看她。"
    "嗯，就像是我知道，她肯定在看我。"
    "哪怕我们之间连视线相交都没有，也没有任何对话。"
    "但这段被完整保留下来的沉默，却让我察觉到了，有如冷萃咖啡般的韵味。"

    "少女的身姿在我余光中闪现，漂浮于空中的点点反射尘在她背后营造出了朦胧的光晕。"

    "听着属于她的呼吸声，还有自那边传过来的小动作杂音，我从心中萌生出一种珍惜。"
    "——我不想毁掉这份细腻的时光。"
    "结果就是，我什么都说不出口。"
    "如果可以的话，我希望时间能被拉长，让我慢慢品味。"
    
    $ jwq.reset_position()
    $ jwq.show("微笑")
    voice "cv2/jiangwanqing/jiangwanqing_0065.ogg"
    jwq "下次，告诉我你喜欢的游戏吧。"

    "她略显寂寥地打破了这个氛围。"

    "咦？"
    "然而，还没等我回话——"

    $ jwq.hide()
    $ lx.reset_position()
    $ lx.show("开心", pos=center)
    voice "cv2/linxi/linxi_0050.ogg"
    lx "啊，你们喝完了没，午休时间快结束了，该走了。"

    cz "嘶，已经这个点了？"

    $ lx.hide()
    $ jwq.show("平静")
    "我看向江晚晴，她只是站了起来，对曦曦点了点头。"
    "这一刻，仿佛先前感受到的一切均是幻觉，是我因为无聊，而像初中二年级小老弟那般，见到美女后展开了狂野妄想。"
    "就在我愣在原地这一刻，跟在曦曦后面，向外走的江晚晴，经过了我的身边。"

    $ jwq.show("落寞", pos=center, x_offset=0, zoom=2, transition=dissolve, y_offset=2100)    
    "她突然靠过来了两步，脸庞近得似乎连呼吸的热量都能感受到。"

    # 此处建议增加一个短暂的转场或立绘放大效果模拟凑近
    voice "cv2/jiangwanqing/jiangwanqing_0066.ogg"
    jwq "不要……忘记哦。"

    "不要忘记什么？"
    "不要忘记告诉你，我喜欢的游戏吗？"
    "她凑得很近，垂在我面前的秀发令我恍惚。"
    "我没能回答眼前的少女。"
    "我只是觉得，她的脸，似乎很软糯的样子。"

    # ================= 场景：街道（回校路上） =================
    scene bg street1_1 with fade
    play music "audio/bgm/BGM_日常4.ogg" loop fadein 1.0

    $ lx.show("忧伤", pos=left, x_offset=250)
    voice "cv2/linxi/linxi_0051.ogg"
    lx "啊啊啊，钱包又瘪了，不行不行，以后不来这里了……"

    cz "嘿，还不是你要来的。"

    $ jwq.reset_position()
    $ jwq.show("游刃有余", pos=right, x_offset=-250)
    voice "cv2/jiangwanqing/jiangwanqing_0067.ogg"
    jwq "居丰行俭，在富能贫。\n节俭可是很重要的，你们要克制一下自己的口腹之欲哦。"

    cz "……你就别说什么节俭不节俭的了，你这身份，说出来感觉像是在嘲笑我们。"

    $ jwq.show("微笑")
    voice "cv2/jiangwanqing/jiangwanqing_0068.ogg"
    jwq "呵呵，我只是一个普通的美少女而已，和你们一样都是普通人，不要带着滤镜看我。"

    $ lx.show("无语")
    voice "cv2/linxi/linxi_0052.ogg"
    lx "……居然有人会自称美少女，这真是我在现实世界里第一次见到。"

    $ jwq.show("游刃有余")
    voice "cv2/jiangwanqing/jiangwanqing_0069.ogg"
    jwq "哦？难道你们更吃那套——明明知道自己长得好看，还故意装谦虚的类型？"

    $ lx.show("平静")
    voice "cv2/linxi/linxi_0053.ogg"
    lx "额，那还是算了。"

    cz "咳咳，美少女什么的姑且放在一边。"
    cz "普通什么的我寻思是搭不上了吧，毕竟你可是通过了省试。让我来说，你没随身携带三五个神秘黑衣墨镜男当保镖，我都觉得是不是搞错了什么。"

    "天选试能给人带来的社会地位还有财富积累，怕是我的认知都够不到边角。"

    $ jwq.show("平静")
    voice "cv2/jiangwanqing/jiangwanqing_0070.ogg"
    jwq "可惜，让你们失望了，我可比你们想象得穷多了。\n所以既没有黑色高级车，也没有跟随在两侧的司机或保镖。"

    "她只是耸了耸肩。"
    "好吧，看她的性格，确实不像是那种喜欢程序化、喜欢大排场的。"

    cz "嗯，这也是一种生活方式。"

    "换我来的话，说不定也会这样，不，不对，我肯定也会这样。"
    "有钱不代表要肆意挥霍，至于豪车名表什么的，那些都是身外之物，我没什么感觉，不如Galgame。"

    "这么一想，我对她也多少有些理解了么。"

    "微弱的热量自心底传来。"
    "这就是，属于江晚晴这位少女的生存姿态。"

    cz "不过话又说回来，反正你这么有钱，偶尔请我们一顿饭应该不是什么问题……"
    "都他妈好朋友，该蹭的饭怎么能不蹭的？"
    "不管怎么说，反正我觉得，江晚晴这人，能处。"

    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ lx.reset_position()
    $ jwq.reset_position()
    $ xl.reset_position()
    return