define n = Character(None, kind=nvl)

label interlude1:
    # --- 场景初始化 ---
    window show
    scene bg room1_4 with Dissolve(1.0)
    play music "audio/bgm/BGM_神秘幻象悲伤.ogg" loop fadein 1.5

    "回到房间，在玩Galgame之前，还有要做的事。"
    "小涟习惯性地在我身边陪着我，并不出声，只是陪伴。"
    "她知道我要做什么，所以才不打扰我。"
    "光是这样，我就感受到了难以置信的满足。"
    "我启动电脑，然后习惯性地打开了十几个常用的Galgame网站。"
    "为了了解业界讯息，还有现在的讨论趋势，这是不得不做的一环。"
    "在让学识与体悟更进一步的意义上，这个环节甚至比实际的游玩Galgame更加重要。"
    cz "我看看我看看，这周有哪些新作跳票……"
    
    nvl clear
    #window show
    window hide           
    with dissolve         
    window show           # 显示NVL窗口
    n "我熟练地查看一圈发售情报中心，接着打开社交媒体，刷着一条条信息，那些都是我关注的厂商动态。"
    n "从中挑选出我觉得不错的废萌，仔细欣赏，然后整理归纳成了资料。"
    n "在这期间，呼吸在安静的房间中显得格外清晰，只有散热风扇发出低低的嗡鸣。"
    n "嗯……《花500元买下同桌》的限定版特典是设定集加广播剧，还算有诚意。"
    n "《比我小的女孩子想当我妈妈》居然有动态主题？不赖，可以期待一下。"
    nvl clear
    n "咦？有一个跳票的，《八条船之恋》……我靠不是吧，我还挺期待这一作的。"
    n "……"
    n "思考化为行动，手指在键盘上敲击，发出清脆的声响。"
    n "随着我的敲击，一个名为「废萌观测站」的文件夹里，又多了一份图文并茂的文档，虽不是工作，但我仍然投入了十二分严谨的热情。"
    n "这不仅是为即将到来的精神食粮做战略储备。"
    n "也是我在网络世界中，施加废萌影响力的关键。"
    nvl clear

    n "没错，我，喜欢废萌。"
    n "而我，也想让更多的人，喜欢上废萌。"
    n "因为我喜欢，我也觉得自己喜欢的东西，值得被人喜欢。"
    n "这是很正常的心理吧？"
    n "所以，我一直在为废萌发声，义无反顾。"
    n "抱有着这份无可置疑的、纯粹的初心，我使用着名为「今日糖分充足」的账号，在网络社区中混迹了多年。"
    n "事到如今，已经积累了一万多的粉丝。"
    nvl clear


    n "【今日糖分充足】\n《废萌观测站第214期：震惊！顶级废萌大厂的新作居然在蹭另一作热度……》"
    n "回车键敲下，这篇标题夸张的文章便经由我的账号发布了出去。"
    n "希望这个标题噱头足够，能吸引到一些流量吧……"
    n "哎，不然真没人看，这也是我混迹多年网络世界的心得。"
    n "随着发布完毕，我切换小号，尝试了下是否能成功搜索到，确认无误后，我安心了，然后，我关闭了网页，不再去管。"
    nvl clear

    n "评论也好，流量也好，在自己要说的东西发布出去后，就都没有太大意义了，看了反而闹心。"
    n "然后，我看到了桌面右下角的通知："
    n "{space=100}——群聊【废萌能量补给中心】(99+未读)——"
    n "要了解当下的趋势，群聊这一块自然也是必看，往往只有在聊天中才能获取到各种小道消息。"
    n "所以我自己建了一个废萌交流群，一是和同好抱团取暖，二是可以借助多种视角来补充自己的缺失。"
    nvl clear

    n "明月の夜>\ \ \ \ @今日糖分充足\ \ \ \ 群主没睡吧，据可靠情报，那个著名的青春伤痛大师岛汐先生今年有三部新作要发售了！"
    n "米玖澪>\ \ \ \ 那个，你听我说啊，所以我希望你好好听我说，我一直相信着你的，因此先好好听我说好吗？那个，我相信你是能明白我的意思的，如果是你的话一定是能够听得懂我说的话的，所以啊，所以……"
    n "我无视了刚刚群友发出的神秘信息，只回复at我的人。"
    n "今日糖分充足>\ \ \ \ 刚看完呢，也不清楚这次是怨妇还是消失的她。"
    nvl clear

    n "明月の夜>\ \ \ \ 感觉是消失的她，简介的味大的快给我冲出幻觉了"
    n "今日糖分充足>\ \ \ \ 不管怎么说至少剧本不会很无聊，而且画师确实不错"
    n "明月の夜>\ \ \ \ 住手你这家伙！现在你已经落魄到全年龄都吹捧了吗！"
    n "今日糖分充足>\ \ \ \ 不不不你先别急，这个作者哪怕是成人向，他的男主不也是人均秒男吗"
    n "明月の夜>\ \ \ \ 这就不得不说起岛汐大师悲惨的过去……"
    nvl clear

    n "OPERrc>\ \ \ \ 我靠，哪个骗我说《打翻牛奶的月亮与数星星的值日生》是废萌的？通宵推完抑郁了……"
    n "今日糖分充足>\ \ \ \ 哈哈哈哈又一个上当的。"
    n "今日糖分充足>\ \ \ \ 但你就说前面够不够废萌吧。"
    n "OPERrc>\ \ \ \ 日常有多甜，刀人就有多狠是吧。你还我白毛女主啊T_T"
    n "柒至_7z>\ \ \ \ 麻了，《樱之师》重置版里怎么还有两女主双双变扶她的h.....理解不能"
    n "今日糖分充足>\ \ \ \ 见怪不怪，自鸽鸽的XP一直都很离谱，这就是我为什么一直强推纯正废萌的原因。"

    nvl clear
    n "我玩了十万三千部Galgame，粪作雷达十分之灵敏，你们啊，还是太年轻！"
    n "今日糖分充足>\ \ \ \ 听哥一句劝，早点回归废萌的怀抱，别去剧情作里找罪受了。"
    n "友则利奈则绪>\ \ \ \ 话说话说，群主这次MNR社新作有妹妹吗？？你要知道如果一部作品缺了妹妹就等于缺了这部作品的灵魂。"
    n "今日糖分充足>\ \ \ \ ……根据目前公开的情报来看是有的。不过MNR社好几年都没出过新作了。这次突然出新作还真的意料之外。"

    nvl clear
    n "友则利奈则绪>\ \ \ \ 这太棒了！你知道吗？妹妹这种东西，对于我们这种妹控玩家来说是至高无上之物。妹恋妹选妹右手，贞妹缘妹彼方妹。还有很多妹妹我都喜欢！！！"
    n "哎，妹控人……没救了……"

    n "炸过的土豆泥>\ \ \ \ 什么妹妹？纯路边！姐姐才是王道好吧！"
    n "炸过的土豆泥>\ \ \ \ 群主，你看到最近要新出的那个姐系作品了嘛？"
    n "炸过的土豆泥>\ \ \ \ 里面贫乳巨乳一应俱全，温柔傲娇百花齐放"
    n "炸过的土豆泥>\ \ \ \ 还有顶级的声优与画师，怎么样？群主认为这一部有没有机会载入史册啊"
    nvl clear

    n "哎，姐控人……你一样……没救了……"
    n "感觉不如我……博爱……"
    n "顺晓编>\ \ \ \ 喂喂喂喂喂，你们都什么品味啊，难道不知道现在的潮流吗。"
    n "顺晓编>\ \ \ \ 现在作品里小孩子可是很厉害！像是在电车上、亲戚家和回家的台阶门口都说不定会遇见很懂哲学的小孩子，我最喜欢这种了！"
    n "今日糖分充足>\ \ \ \ ……"
    n "明月の夜>\ \ \ \ 拖下去电。"
    n "炸过的土豆泥>\ \ \ \ 用小号子弹吧。"
    
    nvl clear
    n "我嘴角无意识地弯起。"
    n "和这些逆天群友聊天，不得不说十分之有趣。"
    n "Ridress>\ \ \ \ 话说之前群聊龙王照片的出处是哪个游戏"
    n "今日糖分充足>\ \ \ \ 十二生肖的报恩吧，感觉这个会社除了这个作品外没什么出名的了，也就龙王出了点圈……而且HCG少得可怜"
    n "今日糖分充足>\ \ \ \ 和这个社差不多的不少，比如之前搞隐身，透视，时停的那个社现在也没什么起色了"
    n "Ridress>\ \ \ \ 确实，画师还跑了。"
    
    nvl clear

    n "单引号减反引号'-'>\ \ \ \ 大佬们，最近补袖子社的galgame觉得有些审美疲劳了。虽然女主都很萌，但是几乎每个作品都一定要加入一些超自然的设定，有点破坏代入感了……有无佬推荐几部没有超自然的校园废萌？"
    n "skshan>\ \ \ \ 超能力不看我大时婷社？"
    n "skshan>\ \ \ \ 哦看错了是不要超能力是吧抱歉"
    n "今日糖分充足>\ \ \ \ 可以去玩fang社。《架向夜空之桥》和《由希望和色彩编织而成》都是纯恋爱向没有超能力设定的游戏……"
    n "要我说废萌还得是本格纯日常。"
    nvl clear

    n "超能力写多了，很多恋爱循序渐进的过程都被各种神秘设定冲淡了，就我作为萌作高手的阅历来说，也是那些不整花活的作品剧本水平更高。"
    n "单引号减反引号'-'>\ \ \ \ 最近在玩swee社的gal…感觉王朝了，世界上怎么会存在杨茉莉这么可爱的青梅……"
    n "今日糖分充足>\ \ \ \ 我是李奈党，嘻嘻。"
    n "言诗心忆璃>\ \ \ \ 啊，好累"
    n "Ridress>\ \ \ \ ？"
    nvl clear

    n "言诗心忆璃>\ \ \ \ 推了一天的旮旯，真是太累了，不过再加加油，还有最后一步，把自己喜欢的剧情抄在小本本上就完成今天的任务了~~"
    n "哈？还有高手？"
    n "我下意识展开询问。"
    n "今日糖分充足>\ \ \ \ 不是吧，手写？"
    n "言诗心忆璃>\ \ \ \ 嗯嗯，我会把自己的想法和喜欢的剧情都手写在笔记本上"
    n "今日糖分充足>\ \ \ \ 啊这，怎么不直接记在手机或者电脑上"
    nvl clear

    n "言诗心忆璃>\ \ \ \ 这你就不懂了呢，你想想看，万一我的笔记本在几千年后被后人发现，会不会成为他们研究作为“古人”的我们的生活方式的参考文献，能给几千年后的人分享自己喜欢的旮旯给木，诶嘿嘿~~~想想都兴奋"
    n "今日糖分充足>\ \ \ \ 看见没？我说，这就叫高手。"
    n "呼，扯了一会有的没的，感觉心情一下子就好了不少。"
    n "和群友们聊天打屁的时光还是不能太过贪恋，感觉今天也该到此为止了。"
    n "而就在这时，忽然看到有几个群友居然开始讨论起我。"
    nvl clear

    n "疯千夜>\ \ \ \ 高手？话说群主你不是说你要去参加天选试吗？嘿嘿，到时候真发达了，可别忘了大伙，爱信等！等你成为真高手的那天！"
    n "齐林索拉>\ \ \ \ 乐，还真是！我说群主也是闹麻了。"
    n "SSR>\ \ \ \ 我靠真的假的，你要去参加天选试？\ \ \ \ @今日糖分充足"
    n "SSR>\ \ \ \ 你不是说要和你的虚拟女友小涟过一辈子吗，没有那种世俗的欲望，怎么还卷起来了。"
    n "额，说是说了，参加天选试，主要也没什么好藏的。"

    nvl clear
    n "到时候就算只通过了初试，他们肯定也会都知道，毕竟所有通过者都会公开，更何况我的目标还不止于此。"
    n "可惜，大伙都以为我口嗨呢。"
    n "总是会拿出这事调侃我，这也是我在群里不得不品鉴的一环了，哎，傻逼群友真是……"
    n "他奶奶的，等我真通过了，吓死你们。"
    n "今日糖分充足>\ \ \ \ 不信？我可是废萌领域大神，和Galgame领域大神没什么差别好吧，小心我隔着屏幕攻略你。"
    n "回车敲出去，随便扯点不痛不痒的话后，我就准备下线。"

    nvl clear
    n "可新的消息，却让我愣了一下。"
    n "诺提拉信徒>\ \ \ \ 大伙也别看不起废萌，我现在读研，跟着导师去考古工地，就发现了不少古人对美少女发癫的证据，好像还有人专门用发糖作品去沟通神明什么的。"
    n "咦？"
    n "今日糖分充足>\ \ \ \ 有点意思哈，细说。"
    n "这倒是没怎么听说过，所以我敲出回复，让他继续说一下。"
    n "古人的道德观念，思考逻辑和现代完全不同，当时他们玩的Galgame，应该也都是在纸上制作出来的，大多数资料都由于战争、社会风潮的改变而被销毁。"
    
    nvl clear
    n "我还算挺感兴趣。"
    n "诺提拉信徒>\ \ \ \ 开个玩笑，这都是我自个寻思的。当牛马当出幻觉了哎，下个星期又要去另一个方……"
    n "今日糖分充足>\ \ \ \ 没事没事，管他真的假的，只要咱们废萌党宣传的好，真的假的都无所谓的，重要的是有没有一套逻辑通顺的解释，你懂吧。"
    n "无非就是议题设置嘛，官方做得，媒体做得，普通民众其实也做得。"
    n "就看你想不想做，有没有这个意识。"

    nvl clear
    n "今日糖分充足>\ \ \ \ 就知道群里有高手，没想到还有搞考古的，就当满足下哥们的好奇。"
    n "齐林索拉>\ \ \ \ 来来来，让我也听听你的发现。"
    n "诺提拉信徒>\ \ \ \ 真没啥，其实就是我前一段时间被导师带出去当苦力，在第一个方挖了个把月什么都没挖到，全是厨余垃圾。"
    n "诺提拉信徒>\ \ \ \ 领队实在看不下去给我换了一个方，那旁边有墓葬群，于是我热火朝天继续干。结果还真给挖出来不少带着美少女雕刻的甲壳。"
    n "今日糖分充足>\ \ \ \ 甲壳？龟甲还是兽骨？上面刻的啥？总不会是傲娇、天然呆这种词吧？（笑）"
    
    nvl clear

    n "诺提拉信徒>\ \ \ \ 那倒不是……是图形，刻得还忒精细。"
    n "诺提拉信徒>\ \ \ \ 我跟你讲，有点离谱的，很可爱，穿着那种像古代祭祀礼服的华丽裙子，但发型和脸，怎么看怎么像现代画风，怪萌的捏"
    n "今日糖分充足>\ \ \ \ 好家伙！"
    n "诺提拉信徒>\ \ \ \ 还有一些符号，跟甲骨文不太一样，更图案化一点，比如连着的心形，或者星星环绕的头像。"
    n "诺提拉信徒>\ \ \ \ 我是怎么看都感觉和恋爱啊，发糖啊有关就是了，不太像是在解析剧情或者展开哲学分析之类的……"

    nvl clear
    n "齐林索拉>\ \ \ \ 额哥们，不会是打灰打出幻觉了？"
    n "诺提拉信徒>\ \ \ \ 操，不至于"
    n "今日糖分充足>\ \ \ \ 人无癖不可与之交，别人喜欢废萌，证明人家和我们一样有品味，但估计生态层面还是和我们一样的吧，只是他卓有地位，所以建了墓。"
    n "大概就是这样了，倒也算正常。"
    n "现代也是什么人都有，少数派哪个时代都存在，古代和现代的区别不会大到哪儿去。"
    n "再加上古人本来就迷信，用这种废萌去当祭神的素材，发发癫嘛，不是不可能，群友也经常发癫。"
    
    nvl clear
    n "我也是经常发癫。"
    n "今日糖分充足>\ \ \ \ 话说，你那个墓是多久前的啊。"
    n "诺提拉信徒>\ \ \ \ 大概是6000年前？那个时期全世界的文明都在探索期呢，确实算不得什么数，各种思想都有，当个研究素材还是有价值的。"
    n "诺提拉信徒>\ \ \ \ 你还别说，我发掘记录还真是这么写的，我东扯扯西扯扯，偷偷摸摸的用学术语言把废萌给扯上去了，嘿嘿，塞点私货，问题不大。"
    n "今日糖分充足>\ \ \ \ 好好好，不赖！"

    nvl clear
    n "嗯嗯，确实是有说法。"
    n "今日糖分充足>\ \ \ \ 一切历史都是当代史，一切解读都是二创，反正都是猜测，不如猜个我们喜欢的版本"
    n "敲完回复，再参与了一些讨论，肯定了我心底的想法。"
    n "然后，我关闭了群聊。"

    window hide
    nvl clear

    "呼，果然啊，和网上的人聊天也是有收益的，总觉得心里某个角落，有一簇小小的火苗被点燃了。"
    "心里诞生出了一种，希望它是真的的强烈愿望。"
    "如果连古老的、庄重的甲壳上都曾镌刻过对萌与美好的追求，那我们这些沉浸在废萌甜蜜中的人，是否在无意间，继承了某种跨越时间的、非常古老而纯粹的情感本能？"
    "只是这么一想，就觉得打了鸡血似的，又有了不少动力。"
    cz "开始推游戏吧……"


    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    # 状态重置
    $ lx.reset_position()
    $ jwq.reset_position()
    $ xl.reset_position()
    
    return