label interlude_interview:

    scene bg hotel_corridor with dissolve
    play music "audio/bgm/BGM_忧郁.ogg" loop fadein 1.0
    "通过指纹、人脸识别后，今天的所有人，已经凭准考证和身份证明报了到。"
    "根据面试序号来看，候考区中的我，已经位于最前。"
    "下一个，就到我了。"
    "衣服贴在身上，让人有些不适，宣告着此刻的紧张。"
    "这是难免的。"
    "但能立于此处，并非偶然。"
    "早就在三年前……对，也就是上一次天选试，我便抱有充足的信心。"
    "如今，对我来说，这份身处当下的事实，算是迟到的一次体验也说不定。"
    cz "（省试么……呵呵，地方还挺高级。）"
    "带着时光沉淀的黏稠，和他人期许的重量，过去与现在，遗憾的心，略有兴奋的心……就这样融合、混杂，渗透进入当下的我。"
    "面对着重要的、让人觉得紧张的环境，有人会感到恐惧，也有人会产生兴奋。"
    "我大概属于后者。"
    "拆开来看，这份由紧张而诞生的兴奋，更像是面对着一个新的自我、一个新的未来，而产生的期待、试探，还有跃跃欲试。"
    "感觉…不差。"
    "……"
    "在走廊中，我百无聊赖，任由思绪打着旋。"
    "除了旁边指引的工作人员外，那摄像头背后想来也是有人盯着，正是因为心里清楚，所以我也没能表现得太过休闲。"
    "我靠在墙边，闭目养神，无视了身后那几位和我处于同一立场的人们。"
    "身居此处，直面着零和博弈的现实，使我们彼此都提不起什么交流的兴致。"
    "说到底，所有人的答题环节都是专门定制，可交流的空间几乎不存。"
    "接下来的流程，我也早已复盘多回。"
    "于我而言，已经没有什么好在意。"
    "在初试成绩公布后，留出了2周左右的时间进行公示，接受社会监督。"
    "然后，再过了一个月，我来到这里。"
    "接下来要去的地方，是考场。"
    "考场内，设有考官席、计时员、记分员等人。"
    "考官由省级官员、学界领袖，以及其他专家团队组成，其中包含主考官一名。"
    "仪态举止、语言表达、思维逻辑、知识储备、见解深度……虽然没有白纸黑字的明说，但是，一切的一切都会作为标准，人尽皆知。"
    "从开场到介绍，从介绍到答题，从追问到互动，从互动到问答。\n每个流程需要做的，都已经熟稔于心。"
    "只需根据自己的状态，自由发挥即可。"
    "况且还有……"
    cz "（晚晴……）"

    show ty_a shadow:
        zoom 0.6
        xalign 0.5
        yalign -0.1
    with dissolve

    "就在这时，前面出现了一个人。"
    "他是刚刚进去的家伙。"
    ty_a "……"
    cz "……"

    "他脸上露出复杂的表情，先是对我点了点头，然后，遗憾似的，摇了摇头。"
    cz "……"

    hide ty_a
    "接着，就这样从我身侧离开。"
    "……"
    "不是，哥们，你谁啊？"
    "除了身边的人之外，我只关注Galgame里的纸片人。"
    "虽然有点眼熟，但是既然不记得了，那大抵无所谓。"
    cz "呼——"
    "我深深地吐出一口气，向前走去。"
    "到我了。"
    "接下来，是战争。"
    
    
    scene bg hotel_livingroom with Dissolve(2.0)
    "来到房间，我先是下意识环绕，看了看这个豪华房间的角落。"
    "计时员、记分员，嗯。"
    "那么，主考官是……"
    
    show other renchao with flash
    
    stop music

    cz "……"
    scene bg hotel_corridor with flash
    "哎？"
    "不是不是不是不是，什么情况？"
    "兽耳娘？"
    "不对不对。"
    "应该是我看花眼了。"
    
    cz "……"
    "再一次，我深吸一口。"

    scene bg hotel_livingroom with Dissolve(2.0)
    "然后，推开门进入。"
    show other renchao
    
    play music "audio/bgm/BGM_日常3.ogg" loop fadein 1.0
    cz "……"

    scene bg black
    hide other renchao
    with dissolve

    "我闭上眼。"
    "嗯，没有什么的。"
    "这很正常。"
    "很正常。"
    "不是主考官在cosplay。"
    "自然也不可能她本身就是兽耳娘。"
    "是的，没错。"
    "她就是一个普通的正常人，是我看错了。"
    "毕竟我脑子本来就有问题。"
    "只是因为紧张了，所以看到了一些奇怪的元素。"
    "其实一切很正常。"
    "只是我可能不太正常。"
    "这也是一种正常，不是吗？"
    "是的，这就正常了！"
    "正常了！"
    "我正常地参加了天选试，\n正常的进入了省试，\n正常的报了名，正常的进了考场！"
    "哈！看吧！我是多么的正常！"
    "嗯，没问题了！"
    
    scene bg hotel_livingroom
    show other renchao
    with dissolve
    "我火速整理好了心情。"
    "然后，开始了我的斗争。"
    "……"
    "…………"
    "………………"
    
    "【主考官接下来会询问Galgame相关问题，其中，有部分题目必须答对。】"
    "【但凡有一个错误，最终便会失败。】"
    "【准备好了就开始吧。】"
    
    menu:
        "???" "你喜欢吃的小零食是？"
        "雪饼":
            pass
        "泡芙":
            pass

    menu:
        "???" "石头门里，能改变世界、让世界重新构筑的原理，被称作什么理论？"
        "时间机器理论":
            pass
        "世界线收束理论":
            $ bad_end_flag += 1
            pass
        "平行宇宙理论":
            pass    
        "量子隐形理论":
            pass

    menu:
        "???" "幼刀的本名是？"
        "樱":
            pass
        "绫":
            $ bad_end_flag += 1
            pass
        "枫":
            pass
        "丛":
            pass

    menu:
        "???" "真祖的公主遇见拥有退魔之血的人类时，被分尸成了……"
        "15块":
            pass
        "16块":
            pass
        "17块":
            $ bad_end_flag += 1
            pass
        "21块":
            pass

    menu:
        "???" "世界是由言语所构成，现在，让你对一个身负罪孽之人说出解脱之言，以使其获得幸福，你会……"
        "可最喜欢你":
            pass
        "你有罪，都是你的错":
            pass

    menu:
        "???" "以下哪位剧本家没有创作过Gal领域以外的作品？"
        "衣笠老贼":
            pass
        "丸户老贼":
            pass
        "三排狂魔伞哥哥":
            pass    
        "暖人心田岛哥哥":
            $ bad_end_flag += 1
            pass
    
    menu:
        "???" "前奏诗中，姬野家的坏女人为什么和男主分手？"
        "主角移情别恋":
            pass
        "被窥视内心":
            $ bad_end_flag += 1
            pass
        "家庭反对":
            pass
        "性格不合，日常矛盾太多":
            pass
    
    menu:
        "???" "作为旮旯给木领域大神，请结合亚文学核心特质、情色创作边界问题以及人体美学理论，思考下列关于视觉小说中HS的核心创作逻辑与原则，告诉我你更倾向哪种？"
        "主打人体美学视觉冲击":
            $ bad_end_flag += 1
            pass
        "是推动剧情的战场":
            $ bad_end_flag += 1
            pass
        "一刀切转向高级审美":
            pass    
        "公式化哦齁齁齁齁":
            $ bad_end_flag += 1
            pass
    
    menu:
        "???" "现在作品均十分考据写实，在改变夜羊社社团命运的作品中女主官方设定已经成年，那么她的鞋码是？"
        "15":
            pass
        "21":
            $ bad_end_flag += 1
            pass
        "30":
            pass    
        "39":
            pass

    "……"
    cz "呼——"
    "一番苦战，我可算是松了一口气。"
    "主考官只是点了点头，而后，冰冷地开始推进下个环节……"

    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    
    $ script_box_alpha = 0.0
    centered "{size=40}— 数十天后 —{/size}"
    $ script_box_alpha = 1.0

    # 全对
    if bad_end_flag >= 7:
        $ achievement.grant("ACH_04")
        $ achievement.sync()
        return
    
    # Bad End
    scene bg room1_4
    camera master at gray_filter
    with Dissolve(2.0)

    play sound fx.light_rain loop fadein 0.5

    "窗外，雨一直下，滴滴答答渗进我心里。"
    "看着窗户，看着那儿反射出来的自己，只觉得，什么都……无所谓了。"
    "不是早就知道了吗？"
    "从那个地方出来时，就知道了。"
    "人力有穷时。"
    "天选试……省试，"
    "我落选了。"
    "这怪谁呢？"
    "只要是不能证伪的，都是可以操作的。"
    "反过来说，只要是可以证伪的，那就将丧失操作的空间。"
    "我当然知道，存在固定答案的题目，不会有任何解释空间……"
    "所以这就是结果了。"
    "我，在某个回答中，犯了错误。"
    "除非神明降临，否则不会有任何力量可以让我通过。"
    "就是这样吧。"
    "就是这样了。"
    "明明想着，我要……"
    "可是……"
    "呵呵，哈哈。"
    "感觉不到自己的身体，我就像是一个飘浮游荡的灵魂。"
    "房间也变得很陌生的样子。"
    "干脆，就这样睡吧。"
    "什么都，和我无关了……"
    "对了对了，明天，玩什么Galgame呢……"

    
    window hide
    stop music fadeout 2.0
    show cinematic_black_overlay
    $ renpy.pause(2.0, hard=True)
    scene black
    $ renpy.pause(1.0, hard=True)
    camera master
    # 显示End字样
    $ script_box_alpha = 0.0
    centered "{size=40}Bad End：{space=50}未能触碰的世界{/size}"
    $ script_box_alpha = 1.0
    # 直接进主菜单
    $ renpy.full_restart()